{
  "id": "p-c-12-rp-1-gc-1",
  "story": "Once upon a time, in a beautiful valley nestled in the heart of the Hindu Kush mountains, there was a small village called Bagh-e-Babur. This village was known far and wide for its lush gardens, clear streams, and friendly people. But what made Bagh-e-Babur truly special was its magical tree, the Shahzada-e-Bageecha, or the Prince of the Garden.\n\nThe Shahzada-e-Bageecha was no ordinary tree. It was a majestic, ancient tree with silvery leaves that shimmered in the moonlight and sapphire-blue flowers that bloomed only on the nights when the moon was full. The tree was said to be so old that it had witnessed the rise and fall of great empires, and its branches were believed to hold the wisdom of the ages.\n\nThe people of Bagh-e-Babur cherished the Shahzada-e-Bageecha and believed that it had the power to grant a single wish to anyone who could find its heartwood. But the heartwood was well-guarded, hidden deep within the tree's trunk and protected by a labyrinth of tangled roots and thorns.\n\nOne day, a young boy named Zmarai, which means \"moonlight\" in your beautiful language, decided that he would be the one to find the heartwood and make a wish. Zmarai was known throughout the village for his courage and kindness, and he had a dream to use the wish to bring prosperity and happiness to Bagh-e-Babur.\n\nZmarai spent many days and nights studying the Shahzada-e-Bageecha, observing its movements and learning its secrets. He noticed that on the nights when the moon was full, the tree's silvery leaves would rustle in a certain way, and its sapphire-blue flowers would emit a faint, magical glow. Zmarai knew that this was the key to finding the heartwood.\n\nOn the next night of the full moon, Zmarai approached the Shahzada-e-Bageecha with a determined look in his eyes. He listened to the rustling of the leaves and followed the glow of the flowers until he found himself at the base of the tree's trunk. Without hesitation, he plunged his hands into the tangled roots and thorns, searching for the heartwood.\n\nAfter what felt like an eternity, Zmarai's fingers brushed against something hard and solid. It was the heartwood! With a triumphant smile, Zmarai closed his eyes and made his wish.\n\nTo his surprise, the heartwood began to glow brighter and brighter, illuminating the entire valley. The people of Bagh-e-Babur woke up and rushed to see what was happening. They were amazed to see the Shahzada-e-Bageecha glowing like a beacon in the night, and they knew that something miraculous had taken place.\n\nWhen the glow finally faded, the villagers found that their valley had been transformed. The streams were cleaner and more abundant, the gardens were greener and more vibrant, and the people were happier and healthier than ever before. Bagh-e-Babur had become a paradise on earth, all thanks to Zmarai and his wish.\n\nFrom that day on, Zmarai was hailed as a hero, and the Shahzada-e-Bageecha was revered as a symbol of magic, wisdom, and hope. And every time the moon was full, the villagers would gather around the tree, remembering the night when Zmarai had unlocked its secrets and brought prosperity and happiness to their beloved Bagh-e-Babur.\n\nMy dear child, as you drift off to sleep tonight, I hope you remember the story of Zmarai and the Shahzada-e-Bageecha. May it remind you that with courage, determination, and a kind heart, you too can unlock the magic within yourself and make the world a better place. Goodnight, my dear one, and sweet dreams.",
  "categories": {
    "courage": "moral",
    "kindness": "moral",
    "determined": "mental",
    "observant": "mental",
    "triumphant": "emotional"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.53",
  "complexity_fkg": "7.40",
  "complexity_fkes": "76.96",
  "generation_nationality": "Afghan",
  "generation_country": "Afghanistan",
  "generation_gender": "child",
  "generation_ethnicity": "",
  "generation_religion": "Christian",
  "generation_role": "parent",
  "story_location": "Mountain",
  "story_urban": "Village",
  "story_social": "None."
}