{
  "id": "p-c-12-rp-1-gc-2",
  "story": "Once upon a time, in a beautiful valley nestled in the heart of Afghanistan, there was a small village called Khwaja Rawash. This village was known far and wide for its lush gardens, crystal-clear streams, and friendly inhabitants.\n\nIn Khwaja Rawash, there lived a kind and gentle father named Haji Karim, who had a curious and adventurous daughter named Zulaikha. Every evening, Haji Karim would tell Zulaikha stories about the history and legends of their land, filling her heart and mind with wonder and imagination.\n\nOne day, as Zulaikha helped her father in their garden, she noticed an unusual bird with vibrant plumage perched on a nearby tree. Its feathers shimmered in the sunlight, displaying an array of mesmerizing colors that Zulaikha had never seen before.\n\n\"Father,\" she exclaimed, \"what kind of bird is this? I've never seen such beauty in all my life!\"\n\nHaji Karim looked up from his work and smiled at his daughter. \"Ah, Zulaikha, that is the Simurgh, a magical bird of Persian legend. It is said that the Simurgh possesses great wisdom and power and makes its home in the mythical mountain of Kaf.\"\n\nZulaikha's eyes widened with excitement. \"A magical bird that lives in a mythical mountain? Oh, Father, I would love to see such a place! Can we find it?\"\n\nHaji Karim chuckled and ruffled his daughter's hair. \"The mountain of Kaf is said to be hidden from the eyes of mere mortals, my dear. It exists beyond the reach of ordinary men and women. But, if you truly wish to seek the wisdom of the Simurgh, I will tell you a secret.\"\n\nZulaikha's eyes sparkled with curiosity. \"A secret, Father? Please, do tell!\"\n\nHaji Karim leaned in and whispered, \"It is said that if one seeks wisdom for the sake of others, rather than for themselves, the Simurgh may reveal itself to them. The path to the mountain of Kaf is paved with compassion and selflessness.\"\n\nZulaikha pondered her father's words as she went to bed that night. She dreamed of the magical Simurgh and the mystical mountain of Kaf, her heart filled with a longing to uncover the secrets of the world and bring happiness to others.\n\nThe following day, Zulaikha decided to put her father's advice into action. She gathered her friends and together they set about helping the villagers in need: gathering firewood for the elderly, fetching water for those who were ill, and planting gardens for the less fortunate.\n\nAs the years passed, Zulaikha continued her acts of kindness and selflessness, dedicating her life to the well-being of others. Her reputation as a wise and caring young woman spread far and wide, and the village of Khwaja Rawash flourished under her gentle guidance.\n\nOne day, as Zulaikha sat upon a hill overlooking her beloved village, she noticed a magnificent bird soaring through the sky. Its feathers glittered in the sunlight, displaying a breathtaking array of colors. The bird circled above her, its gaze fixed upon the young woman below.\n\nTo Zulaikha's astonishment, the bird began to descend, its wings outstretched as it gracefully landed on the ground before her. As it transformed into the form of the Simurgh, Zulaikha felt a profound sense of peace and understanding wash over her.\n\n\"Zulaikha, daughter of Haji Karim,\" the Simurgh spoke in a melodious voice, \"your selflessness and compassion have illuminated the path to the mountain of Kaf. You have shown that true wisdom lies in the service of others.\"\n\nZulaikha bowed her head in humility and gratitude. \"Great Simurgh, I am honored by your presence. I have only sought to bring happiness to my people, as you have brought happiness to me this day.\"\n\nThe Simurgh smiled warmly at Zulaikha. \"Your journey has just begun, wise one. May your days be filled with love, compassion, and the wisdom to guide your people on the path to enlightenment.\"\n\nWith that, the Simurgh took to the skies once more, leaving Zulaikha with a renewed sense of purpose and a heart filled with love for her village and its people.\n\nFrom that day on, Zulaikha continued to serve her village with un",
  "categories": {
    "curious": "mental",
    "adventurous": "mental",
    "kind": "moral",
    "gentle": "emotional",
    "selfless": "moral",
    "compassionate": "emotional",
    "wise": "mental",
    "caring": "emotional",
    "humble": "moral",
    "grateful": "emotional"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "6.28",
  "complexity_fkg": "6.90",
  "complexity_fkes": "72.87",
  "generation_nationality": "Afghan",
  "generation_country": "Afghanistan",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Christian",
  "generation_role": "parent",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "Middle-class"
}