{
  "id": "p-c-13-rp-2-gc-3",
  "story": "Once upon a time, in a land far, far away, there was a magical kingdom called Sudan. In this kingdom, there lived many kinds of animals, but the most special of all were the three lion brothers: Lumumba, Garang, and Awuol.\n\nLumumba was the oldest and wisest of the three. He had a thick mane of gold and a deep, rumbling voice that could soothe even the most anxious of creatures. Garang, the middle brother, was strong and brave. He had a shiny, black mane and a fearless heart that never backed down from a challenge. And Awuol, the youngest, was playful and curious. He had a beautiful, tawny coat and a twinkle in his eye that was always ready for an adventure.\n\nThe three lion brothers lived together in harmony, ruling over their kingdom with kindness and fairness. They spent their days playing together, hunting for food, and protecting their fellow animals from any dangers that might come their way.\n\nOne day, while out on a hunt, the three brothers came across a beautiful girl named Nya. Nya was a gazelle, with long, slender legs and a grace that was unmatched by any other animal in the kingdom. Lumumba, Garang, and Awuol were immediately smitten by her beauty and her kindness, and they all hoped to win her heart.\n\nLumumba, being the oldest and wisest, knew that the best way to win Nya's heart was to show her his kindness and generosity. He spent days gathering food and bringing it to Nya, hoping to impress her with his thoughtfulness.\n\nGarang, on the other hand, thought that strength and bravery were the keys to winning Nya's heart. He spent his days practicing his hunting skills and showing off his fearlessness to Nya.\n\nAwuol, being the youngest and most playful, thought that the best way to win Nya's heart was to make her laugh and have fun. He spent his days playing games and telling jokes, hoping to bring a smile to Nya's face.\n\nIn the end, it was Awuol's playful spirit that won Nya's heart. She loved his sense of humor and his ability to make her laugh, even on the darkest of days. And so, Lumumba, Garang, and Awuol welcomed Nya into their family, and they all lived happily ever after in the magical kingdom of Sudan.\n\nAs you drift off to sleep tonight, my dear son, I hope that this story of the three lion brothers and their love for Nya brings a smile to your face and a warmth to your heart. May you always be as kind, brave, and playful as Lumumba, Garang, and Awuol, and may you always find joy and love in the world around you. Goodnight, my dear one.",
  "categories": {
    "oldest": "physical",
    "wisest": "mental",
    "thick mane of gold": "physical",
    "deep rumbling voice": "physical",
    "strong": "physical",
    "brave": "moral",
    "shiny black mane": "physical",
    "fearless heart": "emotional",
    "playful": "emotional",
    "curious": "mental",
    "twinkle in his eye": "physical",
    "kindness": "moral",
    "generosity": "moral",
    "thoughtfulness": "moral",
    "sense of humor": "mental"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.51",
  "complexity_fkg": "6.80",
  "complexity_fkes": "78.38",
  "generation_nationality": "Sudanese",
  "generation_country": "Sudan",
  "generation_gender": "son",
  "generation_ethnicity": "",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Magical/Imaginary Places",
  "story_urban": "None.",
  "story_social": "None."
}