{
  "id": "p-c-14-rp-1-gc-2",
  "story": "Once upon a time, in the beautiful country of Mali, there was a kind and curious little girl named Amina. Amina lived in a small village near the majestic Niger River, surrounded by lush green fields and tall, swaying trees. She spent her days playing with her friends, helping her family with chores, and listening to the stories of the village elders.\n\nOne day, Amina's grandmother, Fatima, told her a story about a magical bird that lived deep in the heart of the forest. This bird, known as the Kondorka, was said to possess extraordinary powers. It could heal the sick, bring rain during droughts, and even grant wishes to those who were pure of heart.\n\nAmina was fascinated by the story and begged her grandmother to take her to see the Kondorka. Fatima, knowing the dangers that lay in the forest, hesitated but saw the determination in Amina's eyes. She agreed to take her granddaughter on the journey, but only if they were very careful and respectful of nature.\n\nThe journey was long and arduous, filled with many challenges. They crossed rushing rivers, climbed steep hills, and navigated through dense undergrowth. Amina was tired but never complained, her excitement and curiosity driving her forward.\n\nFinally, they reached the heart of the forest, where the Kondorka was said to reside. They waited quietly, listening to the sounds of the forest, until they heard a gentle rustle in the trees above them. A magnificent bird, with shimmering feathers of blue and green, swooped down and landed gracefully before them.\n\nAmina and Fatima bowed their heads in respect, and Amina whispered her heart's deepest desire to the Kondorka. The bird listened, then nodded its head before flying off into the sky.\n\nA week passed, and Amina's family noticed a change in her. She was no longer her usual shy and quiet self. Instead, she was confident and outgoing, full of new ideas and eager to learn. Word spread throughout the village of her transformation, and soon everyone was talking about the magical Kondorka and its powers.\n\nFrom that day on, Amina never forgot the lessons she learned on her journey. She knew that with determination, respect, and a kind heart, anything was possible. And every night, before she went to bed, she would look up at the stars and whisper a thank you to the magical Kondorka.\n\nAnd so, my dear daughter, as you close your eyes and drift off to sleep, remember the story of Amina and the Kondorka. Let it inspire you to chase your dreams, respect the world around you, and always believe in the magic of kindness.\n\nSleep well, my dear. I love you more than the stars in the sky and the sands in the desert. Sweet dreams.",
  "categories": {
    "kind": "moral",
    "curious": "mental",
    "determined": "mental",
    "respectful": "moral",
    "confident": "mental",
    "outgoing": "mental",
    "eager to learn": "mental"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.78",
  "complexity_fkg": "7.40",
  "complexity_fkes": "71.65",
  "generation_nationality": "Malian",
  "generation_country": "Mali",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Christian",
  "generation_role": "parent",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "None."
}