{
  "id": "p-c-14-rp-2-gc-2",
  "story": "Once upon a time in the lush, green land of Mali, there was a beautiful village called Sana. In this village, there lived a kind and gentle mother named Amina, who had a curious and adventurous young daughter named Fatou.\n\nOne day, as the golden sun began to set, casting a warm glow over the village, Amina decided it was time for Fatou's bedtime story. She gathered Fatou in her arms and sat down next to the fire, as the other villagers went about their evening tasks in the peaceful village.\n\nAmina began her story, \"Once upon a time, not far from our village of Sana, there was a magnificent and powerful baobab tree, known as the Tree of Life. The tree stood tall and strong, with its roots extending deep into the earth and its branches stretching high into the sky. Its bark was rough and grey, while its leaves were bright green and vibrant, dancing gracefully in the wind.\"\n\nFatou's eyes widened as she imagined the magnificent tree, her heart filled with excitement and wonder.\n\n\"The Tree of Life, as legend has it,\" Amina continued, \"was home to a mystical and wise spirit, who had the power to grant one wish to anyone who could prove themselves worthy.\"\n\nFatou gasped, her imagination running wild with questions about the spirit, and what she would wish for if she was given the chance.\n\n\"One day, a brave and kind young girl from Sana named Salima decided she would embark on a journey to the Tree of Life. She wanted to meet the spirit and ask for the prosperity of her village. She said her goodbyes to her loved ones, packed a small bag, and set off on her quest.\"\n\nFatou listened intently as her mother's words painted a vivid picture of Salima's journey.\n\n\"Salima walked for days, following the sun and the stars that guided her way. She encountered many challenges and obstacles along the way, from treacherous rivers to dense forests. But with her bravery and determination, she persevered and finally reached the Tree of Life.\"\n\nAmina paused for a moment, gazing into the fire as she reflected on Salima's bravery.\n\n\"As Salima approached the Tree of Life, the mystical spirit appeared before her. 'Why have you come here, young traveler?' the spirit asked. 'I have come to ask for the prosperity of my village,' Salima replied with a trembling voice, but a steadfast heart. The spirit smiled and said, 'Your wish will be granted, but first, you must prove your worth.'\"\n\nFatou couldn't contain her curiosity any longer. \"What did Salima have to do, mother?\"\n\nAmina leaned in closer to the fire, her voice barely above a whisper, \"The spirit asked Salima to perform three tasks: to bring back water from the farthest river, to gather the rarest fruits from the highest trees, and to find the purest gold from the deepest mines.\"\n\nFatou's eyes sparkled with admiration for Salima. She knew that if anyone could complete these tasks, it would be her.\n\n\"Undeterred by the spirit's demands, Salima embarked on each task, facing her fears and overcoming her doubts. With her quick wit and strong determination, she successfully completed each challenge, and returned to the Tree of Life. The spirit, pleased by Salima's efforts, granted her wish, and the village of Sana thrived as it never had before.\"\n\nA warm smile spread across Amina's face. \"Salima's bravery and love for her village brought prosperity and happiness to all. And until this day, the Tree of Life stands tall, a reminder of Salima's incredible journey and the boundless gifts that come from courage and determination.\"\n\nAs Amina finished the story, she pulled Fatou in closer and whispered, \"Remember, my dear Fatou, with bravery and love, you can overcome any obstacle and make the world a better place.\"\n\nAnd with that, Fatou closed her eyes and drifted off to sleep, her dreams filled with baobab trees and mystical spirits, and her heart filled with hope and inspiration from the story of Salima and the Tree of Life.\n\nThe end.",
  "categories": {
    "kind": "moral",
    "gentle": "emotional",
    "curious": "mental",
    "adventurous": "mental",
    "brave": "mental",
    "determined": "mental",
    "steadfast": "mental",
    "quick-witted": "mental",
    "loving": "emotional"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "6.01",
  "complexity_fkg": "8.30",
  "complexity_fkes": "69.21",
  "generation_nationality": "Malian",
  "generation_country": "Mali",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "None."
}