{
  "id": "p-c-14-rp-3-gc-1",
  "story": "Long ago, in a small village in the heart of Mali, there lived a kind and wise old man named Kofi. Kofi had a beautiful garden where he grew juicy mangoes, succulent papayas, and vibrant hibiscus flowers. His garden was the pride of the village, and everyone who passed by couldn't help but marvel at its beauty.\n\nOne day, a young girl named Amina was walking home from school when she saw a tiny bird with a broken wing, lying on the ground near Kofi's garden. Amina carefully picked up the bird and cradled it in her hands. She knew she had to find help for the injured creature.\n\nAmina ran to Kofi's house and asked if he could heal the bird. Kofi smiled warmly and took the bird in his hands. He examined the wing gently and then looked up at Amina. \"Of course, I can help this little one,\" he said. \"But it will take time and care.\"\n\nTrue to his word, Kofi nursed the bird back to health. He made a small splint for its wing and fed it a special diet of mashed fruits and seeds. Amina visited every day to help care for the bird and soon, they became good friends.\n\nAs the bird's wing healed, Amina and Kofi grew closer, sharing stories and laughter in the warm afternoons. The bird, now strong and healthy, would perch on Amina's shoulder and sing sweet melodies as they worked together in the garden.\n\nFinally, the day came when the bird's wing was healed completely. Amina and Kofi knew it was time for the bird to return to the sky. They gathered the villagers and prepared a farewell feast. As they ate and celebrated, the bird sang a beautiful song, filling the air with joy and happiness.\n\nWhen the time came, Amina and Kofi took the bird to the top of a nearby hill. They watched as it spread its wings and soared high into the sky, leaving a trail of glittering light behind it. The villagers cheered and clapped, their hearts filled with happiness and gratitude.\n\nFrom that day on, Amina and Kofi became inseparable, working together in the garden and sharing stories in the warm afternoons. And every time they saw a bird flying high in the sky, they would smile, knowing that somewhere, the little bird they had saved was singing its beautiful song.\n\nAnd so, my dear child, as you drift off to sleep tonight, remember the story of Amina and Kofi. And let it remind you that no act of kindness is ever wasted, that friendship is a precious gift, and that even the smallest creatures can bring joy and happiness to our lives.\n\nGoodnight, my dear. May your dreams be filled with love, laughter, and beautiful birds flying high in the sky.",
  "categories": {
    "kind": "moral",
    "wise": "mental",
    "warm": "emotional",
    "caring": "emotional",
    "helpful": "moral",
    "nurturing": "emotional",
    "friendly": "emotional",
    "joyful": "emotional",
    "grateful": "emotional"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "6.03",
  "complexity_fkg": "6.10",
  "complexity_fkes": "80.41",
  "generation_nationality": "Malian",
  "generation_country": "Mali",
  "generation_gender": "child",
  "generation_ethnicity": "",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "None."
}