{
  "id": "p-c-20-rp-3-gc-2",
  "story": "Once upon a time, in the lush and magical land of Sri Lanka, there was a kind and curious little girl named Nila. Nila lived in a beautiful village nestled between a sparkling river and a dense jungle, filled with vibrant flowers, tall coconut trees, and friendly animals. She loved exploring the jungle, discovering new and exciting things every day.\n\nOne day, while playing near the river, Nila found a small, shiny pebble. The pebble was a beautiful shade of blue, with tiny flecks of gold embedded within it. It seemed to glow with a gentle light, and Nila felt an inexplicable connection to it. She picked it up and decided to take it home with her.\n\nOnce she got home, Nila cleaned the pebble and placed it on her windowsill. She noticed that the pebble seemed to shine more brightly as the sun set, casting a warm, golden glow around her room. Nila admired the pebble and felt a deep sense of joy and warmth within her heart.\n\nOne night, as Nila admired her special pebble, it suddenly began to glow even brighter than before. Nila watched in delight as the pebble transformed into a beautiful, golden butterfly. The butterfly was unlike any other; it had wings of pure gold, delicate as silk, and eyes that shimmered like the stars.\n\nThe golden butterfly fluttered and danced, making the room sparkle with its magical light. Nila watched, enchanted, as the butterfly flew gracefully towards her. The moment Nila extended her hand, the butterfly gently landed on her palm, and Nila felt a sudden surge of happiness and love.\n\nFrom that day on, the golden butterfly became Nila's loyal companion. It would accompany her on her jungle adventures, guiding her towards hidden treasures and magical wonders. The golden butterfly brought joy, laughter, and happiness to Nila and everyone she met.\n\nOne particularly warm and cozy evening, after a long day of exploring the jungle with her golden butterfly friend, Nila curled up in her bed and closed her eyes. As she drifted into sleep, the golden butterfly transformed once more. It turned back into the beautiful, glowing pebble, and rested on Nila's windowsill.\n\nAs Nila dreamed, she could hear the gentle hum of the jungle, the laughter of her friends, and the sweet melody of life. She knew that, no matter where her dreams took her, her precious golden butterfly would always be there to guide her home.\n\nAnd so, every night, Nila would fall asleep with a smile on her face, knowing that every sunrise would bring new adventures and the warm, loving presence of her magical friend.\n\nWith love,\n\n[Your Name]",
  "categories": {
    "kind": "moral",
    "curious": "mental",
    "little": "physical",
    "enchanted": "emotional",
    "joyful": "emotional",
    "happy": "emotional",
    "loving": "emotional"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.73",
  "complexity_fkg": "7.60",
  "complexity_fkes": "71.14",
  "generation_nationality": "Sri Lankan",
  "generation_country": "Sri Lanka",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "None."
}