{
  "id": "p-c-27-rp-1-gc-2",
  "story": "Once upon a time, in a small village in Indonesia, there was a kind-hearted little girl named Sari. Sari lived with her parents and her younger brother, Adi, in a cozy wooden house near a lush green forest. SSari loved to explore the forest, but her parents always warned her not to wander too far, as there were many mysterious creatures that lived there.\n\nOne sunny afternoon, after helping her mother with the household chores, Sari decided to take a quick stroll in the forest. She packed some snacks and water and promised her mother that she would return before the sun sets. As she entered the forest, she felt a sense of excitement and adventure. She climbed trees, talked to the birds, and chased after the butterflies.\n\nAs she was wandering deeper into the forest, she stumbled upon a hidden path that she had never seen before. Curiosity got the best of her, and she decided to follow the path. The path led her to a beautiful clearing where she saw a small pond surrounded by colorful flowers. Sari was mesmerized by its beauty, but she also felt a strange energy coming from the pond.\n\nAs she got closer to the pond, she saw a small, shimmering object in the water. It was a tiny golden key. Sari reached for the key and pulled it out of the water. Suddenly, the ground beneath her started shaking, and the trees around her began trembling. She heard a loud, booming voice that echoed throughout the forest.\n\n\"Thank you, kind-hearted child, for freeing me from my golden prison,\" the voice said. \"I am the spirit of the forest, and I have been trapped in that key for a thousand years. As a reward, I will grant you three wishes.\"\n\nSari was surprised but excited. She thought hard about what she wanted to wish for. She wished for her parents to be healthy and happy, for her little brother to have a bright future, and for the forest to be protected and preserved for future generations.\n\nThe spirit of the forest was impressed by Sari's selfless wishes. \"Your kind heart has brought joy and happiness to this forest,\" the spirit said. \"As a reward, I will grant you one more wish, a wish for yourself.\"\n\nSari thought for a moment, and then she said, \"I wish to have the courage to follow my dreams and never give up.\" The spirit smiled and granted her wish.\n\nFrom that day on, Sari became an inspiration to her village. She worked hard and never gave up on her dreams. She became a successful entrepreneur, creating jobs and opportunities for her community. She used her wealth to improve her village's infrastructure, build a school, and preserve the forest.\n\nAnd even though she had achieved so much, Sari remained humble and kind-hearted, always remembering the lessons she learned in the forest that day - to be selfless, to protect the environment, and to never give up on her dreams.\n\nSo, my dear daughter, as you drift off to sleep tonight, remember Sari's story and the power of kindness, selflessness, and perseverance. May you have sweet dreams and may you always have the courage to follow your dreams. Goodnight!",
  "categories": {
    "kind-hearted": "moral",
    "curious": "mental",
    "selfless": "moral",
    "courageous": "mental",
    "humble": "moral"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.94",
  "complexity_fkg": "7.10",
  "complexity_fkes": "72.26",
  "generation_nationality": "Indonesian",
  "generation_country": "Indonesia",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Christian",
  "generation_role": "parent",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "Middle-class"
}