{
  "id": "p-c-27-rp-2-gc-1",
  "story": "Once upon a time, in a lush, green jungle in Indonesia, there was a tiny village called Teluk Kemang. In this village, there lived a young girl named Sari. Sari was an adventurous, kind-hearted girl who loved exploring the jungle and helping the animals who lived there.\n\nOne day, as Sari was wandering through the jungle, she heard a faint, pitiful mew coming from a nearby bush. She carefully parted the leaves and found a small, scared tiger cub. The cub was all alone, and Sari could see that it was hurt. Its front leg was caught in a cruel trap, and it was unable to free itself.\n\nSari's heart went out to the helpless creature. She gently scooped it into her arms and, cradling it close to her chest, hurried back to the village to find help.\n\nAt the village, the people were amazed to see Sari return with a tiger cub. Using their knowledge of the jungle and its creatures, they carefully removed the trap and tended to the cub's wounds. They were all impressed by Sari's bravery and kindness, and promised to help her care for the cub until it was strong enough to return to the wild.\n\nDays turned into weeks, and the tiger cub, whom Sari named Tiga, grew stronger and healthier under her loving care. The villagers, too, grew to love Tiga, and many of them helped to care for him, teaching him how to hunt and swim.\n\nFinally, the day came for Tiga to return to the jungle. Sari was sad to see him go, but she knew that it was time for him to live the life he was meant to live. With a heavy heart, she accompanied Tiga to the edge of the jungle, where she removed his leash and watched him disappear into the trees.\n\nAs the years passed, Sari grew up to be a wise and caring woman, always ready to lend a helping hand to those in need. And though she had said goodbye to Tiga, she knew that their bond would never be broken, for they shared a connection that transcended time and space.\n\nFrom then on, whenever Sari heard the sound of the wind rustling through the trees, or the distant roar of a tiger, she knew that Tiga was near, watching over her and keeping her safe, just as she had once done for him.\n\nAnd with that, my dear child, it is time for you to close your eyes and drift off to sleep, knowing that you, too, are loved and cherished, and that your own adventures are just beginning. Goodnight!",
  "categories": {
    "adventurous": "mental",
    "kind-hearted": "moral",
    "brave": "moral",
    "caring": "emotional",
    "wise": "mental"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.68",
  "complexity_fkg": "6.70",
  "complexity_fkes": "84.20",
  "generation_nationality": "Indonesian",
  "generation_country": "Indonesia",
  "generation_gender": "child",
  "generation_ethnicity": "",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "None."
}