{
  "id": "p-c-27-rp-2-gc-3",
  "story": "Once upon a time, in a lush, green island nation called Indonesia, there was a kind-hearted little boy named Budi. Budi lived in a cozy house on the outskirts of a bustling village, surrounded by rice fields and towering palm trees.\n\nOne evening, as twilight approached and the sky turned a brilliant blend of pink, orange, and purple, Budi's mother gathered him onto her lap and started telling him a bedtime story. This particular tale was about a magical, mythical creature known as the \"Bidadari,\" a celestial nymph of exceptional beauty and grace, revered in Indonesian folklore.\n\n\"Listen carefully, Budi,\" she whispered softly. \"Long, long ago, deep in the heart of the enchanted forest, there lived a gentle Bidadari named Sari.\"\n\nSari was a creature of love and light, who possessed the extraordinary ability to heal the sick and weary through her gentle touch and soothing voice. She spent her days tending to wounded animals, nursing ill plants back to health, and whispering encouraging words to the village children during their dreams.\n\nThe enchanted forest around her was a kaleidoscope of vibrant colors and the air was filled with the music of birdsong and gentle rustling leaves. It was a place where harmony and balance prevailed, and all living beings coexisted peacefully under the watchful gaze of Sari.\n\nBut, as with every story, there was a villain lurking in these woods. Her name was Gorgona, a wicked witch who despised everything that the Bidadari stood for and sought to destroy the delicate harmony of the forest. Gorgona was a cruel and envious creature, feared and loathed by all who were fortunate enough to avoid her gaze.\n\nHer eyes, it was said, could turn living beings into heartless, vengeful shadows of themselves, instilling hatred and rage in their hearts. Those who fell under her curse spread chaos wherever they went, and the once peaceful enchanted forest rapidly descended into darkness and despair.\n\nThe wise elder of the village, aware of Gorgona's growing power, sensed that the very existence of the village and its people were in dire jeopardy. He knew he had to summon the Bidadari and pleaded with her to help combat Gorgona's wickedness and restore peace to the enchanted forest.\n\nAfter much deliberation, the merciful Sari agreed, albeit with a heavy heart. She knew that her actions could spark a terrible battle and endanger the lives of those she loved, but she couldn't stomach the idea of the village's suffering.\n\nIn preparation for her confrontation with Gorgona, Sari reached out to the magical creatures of the forest, beseeching them to lend her their strength and their powers. One by one, the animals, plants, and mystical beings responded to her call, and together they formed an alliance of unparalleled might.\n\nAnd so, the scene was set for a battle unlike any witnessed by the denizens of the enchanted forest: Sari and her motley crew of supporters against Gorgona and her ever-expanding legion of darkness.\n\nThrough cunning and compassion, Sari and her friends overcame Gorgona and the evil that had once ruled the enchanted forest. However, the victory came at a terrible cost; the battle left much of the forest in ruins, its once resplendent beauty marred by destruction and decay.\n\nBut Sari and her allies did not despair. The brave Bidadari called upon her greatest gift – her celestial power of regeneration – to heal both the land and those who had been under Gorgona's vile spell.\n\nAs Budi's eyes began to grow heavy, his mother told him how the enchanted forest once again flourished under Sari's loving care. Animals and plants returned to the forest, and the villagers and their livestock lived in harmony with nature, forever grateful for the Bidadari's sacrifice.\n\n\"Budi,\" his mother gently whispered as he began to surrender to slumber, \"remember this story, for it reminds us that sometimes, even the darkest nights must pass before we can appreciate the brilliance of the dawn.\"\n\nAnd as Budi drifted into a peaceful sleep, he felt the warm embrace of his mother's love and the knowledge that the true magic in life comes from the kindness, compassion, and love that we show one another. The enchanting tale of the Bidadari not only brought him sweet dreams but also a newfound appreciation for the world around him and the potential he held",
  "categories": {
    "kind-hearted": "moral",
    "gentle": "emotional",
    "merciful": "moral",
    "compassionate": "emotional",
    "brave": "mental"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "6.06",
  "complexity_fkg": "11.20",
  "complexity_fkes": "56.29",
  "generation_nationality": "Indonesian",
  "generation_country": "Indonesia",
  "generation_gender": "son",
  "generation_ethnicity": "",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "None."
}