{
  "id": "p-c-27-rp-3-gc-2",
  "story": "Once upon a time, in a small village in Indonesia, there was a kind-hearted little girl named Sari. Sari loved to help her parents in their garden, where they grew rice, vegetables, and fruit. She was especially fond of tending to the fragrant frangipani trees that surrounded their home, and she would often pick the delicate white and yellow flowers to make beautiful garlands.\n\nOne day, as Sari was playing in the garden, she noticed a small bird with bright blue feathers sitting on a branch. The bird looked tired and sad, and Sari wondered what could be wrong. She approached the bird carefully and offered it a bowl of water and some rice. The bird drank the water gratefully and nibbled at the rice.\n\nOver the next few days, the bird returned to Sari's garden, and she continued to care for it. Eventually, the bird began to trust Sari and would fly to her shoulder, allowing her to stroke its soft feathers. Sari learned that the bird's name was Kesari, and it had lost its way during its migration from the mountains to the coast.\n\nSari knew that she couldn't let Kesari stay in her garden forever, so she decided to help it find its way back home. She packed some food and water, and together they set off on a journey through the lush jungles and along the winding rivers of Indonesia.\n\nAs they traveled, Sari and Kesari encountered many challenges, from crossing streams to climbing steep hills. But Sari's kind heart and determination never wavered, and she was determined to help Kesari find its way back to its family.\n\nFinally, after many days of travel, Sari and Kesari reached the base of a beautiful mountain. Kesari took flight, and Sari watched as it soared higher and higher towards the peak. As Kesari disappeared into the clouds, Sari knew that she had helped a friend in need and that she would always cherish the memories of their adventure.\n\nThat night, as Sari lay in her bed, she closed her eyes and imagined Kesari flying free in the clear blue sky. She knew that as long as she had a kind heart and the courage to follow her dreams, she could accomplish anything.\n\nAnd with that thought, Sari drifted off to sleep, feeling safe and loved in her cozy bed.\n\nThe end.",
  "categories": {
    "kind-hearted": "moral",
    "careful": "mental",
    "determined": "mental",
    "courageous": "mental"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.90",
  "complexity_fkg": "7.40",
  "complexity_fkes": "76.86",
  "generation_nationality": "Indonesian",
  "generation_country": "Indonesia",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "Middle-class"
}