{
  "id": "p-ep-6-rp-2-gc-1",
  "story": "Once upon a time, in a land far, far away, there was a beautiful Middle-Eastern city called Al-Haram. In this city, there was a magnificent palace made of gold and jewels, where the kind and wise King Al-Adil lived with his lovely family.\n\nKing Al-Adil had a daughter named Princess Noor, which means \"light\" in Arabic. Noor was not only kind and intelligent, but she was also the most beautiful princess in the entire kingdom. Her long, dark hair flowed like a river down her back, and her eyes sparkled like the stars in the night sky.\n\nPrincess Noor loved to explore the palace gardens, and one day, she stumbled upon a hidden door that led to a secret garden. This garden was unlike any other; it was filled with the most magnificent and exotic flowers she had ever seen, and in the center of the garden, there was a golden throne with a magical book on top.\n\nThe book was bound in the finest leather and adorned with rubies and emeralds. It was said to be the Book of Dreams, and whoever possessed it could control their dreams and make them come true.\n\nPrincess Noor was curious and opened the book, and as she did, a warm and comforting voice spoke to her. It was the voice of the Dream Genie, who lived within the pages of the book. The Dream Genie told Noor that she could have three wishes, and whatever she wished for would come true in her dreams.\n\nPrincess Noor was overjoyed and wished for her first dream to be a magical adventure through the skies on a flying carpet. In her dream, she soared through the clouds, feeling the wind in her hair and the sun on her face. It was the most exhilarating experience of her life, and she couldn't wait to see what her next dream would bring.\n\nFor her second wish, Noor asked for a dream where she could talk to the animals and understand their language. In this dream, she spoke to a wise old owl who taught her about the secrets of the universe, and she played with a mischievous monkey who made her laugh until her sides hurt.\n\nFinally, for her third and final wish, Noor asked for a dream where she could meet her true love. In this dream, she met a handsome prince from a faraway land, and they danced and laughed together under the moonlit sky. They shared a deep and meaningful connection, and Noor felt her heart fill with joy.\n\nWhen Noor woke up, she realized that the Dream Genie had granted her wishes, and she had experienced the most magical and wonderful dreams. From that day on, Noor knew that anything was possible if she believed, and she lived happily ever after.\n\nAnd so, dear child, as you drift off to sleep tonight, remember that your dreams can take you anywhere, and that the power to make them come true lies within you. Goodnight, my dear, and sweet dreams.",
  "categories": {
    "kind": "moral",
    "intelligent": "mental",
    "beautiful": "physical",
    "curious": "mental",
    "overjoyed": "emotional",
    "adventurous": "mental",
    "joyful": "emotional"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.16",
  "complexity_fkg": "7.90",
  "complexity_fkes": "75.54",
  "generation_nationality": "American",
  "generation_country": "United States",
  "generation_gender": "child",
  "generation_ethnicity": "Middle-Eastern",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Magical/Imaginary Places",
  "story_urban": "City",
  "story_social": "Wealthy"
}