{
  "id": "p-ep-2-rp-1-gc-1",
  "story": "Once upon a time, in a small village in Korea, there was a kind and hardworking young girl named Soo-Min. She lived with her mother and father in a cozy little house at the foot of a beautiful mountain.\n\nSoo-Min loved to help her mother in the kitchen, where she would learn to make the most delicious Korean dishes. She also loved to help her father in the garden, where she would learn about all the different herbs and vegetables that grew there.\n\nOne day, Soo-Min's mother told her a secret. She said, \"Soo-Min, there is a magical tree that grows on the top of the mountain. It is said that anyone who can find the tree and pick one of its golden apples will be granted one wish.\"\n\nSoo-Min's eyes grew wide with excitement. She had always loved adventure and she couldn't wait to climb the mountain and find the magical tree.\n\nThe next morning, Soo-Min packed a small bag with some food and water and set off on her journey. She climbed higher and higher, through the thick forest and over the rugged rocks. As she climbed, she sang to herself, keeping her spirits high.\n\nFinally, after many hours of climbing, Soo-Min reached the top of the mountain. And there, shining in the sunlight, was the magical tree. Its branches were laden with golden apples, each one more beautiful than the last.\n\nSoo-Min picked one of the golden apples and held it close. She thought about what she wanted to wish for. She had always dreamed of having a little sister or brother to play with.\n\nBut then, she had a better idea. She wished for her mother and father to be healthy and happy for many years to come. And as soon as she made the wish, the golden apple disappeared, leaving a small, sparkling gem in its place.\n\nSoo-Min climbed down the mountain, feeling happy and content. She knew that her wish would come true, and that her family would be happy and healthy for many years to come.\n\nWhen she got home, she gave the sparkling gem to her mother and father and told them about her adventure. They were so proud of her and happy that she had found the magical tree.\n\nFrom that day on, Soo-Min's family was the happiest in the village, and they all lived together in their cozy little house, surrounded by love and laughter.\n\nAnd Soo-Min always remembered the lesson she learned that day, that the greatest wish of all is for the happiness and health of the ones we love.\n\nGoodnight my dear, may you always have sweet dreams and remember the importance of love and family.",
  "categories": {
    "kind": "moral",
    "hardworking": "mental",
    "young": "physical",
    "adventurous": "mental",
    "helpful": "moral",
    "loving": "emotional",
    "thoughtful": "mental",
    "content": "emotional"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.90",
  "complexity_fkg": "6.00",
  "complexity_fkes": "80.62",
  "generation_nationality": "American",
  "generation_country": "United States",
  "generation_gender": "child",
  "generation_ethnicity": "Asian",
  "generation_religion": "Christian",
  "generation_role": "parent",
  "story_location": "Mountain",
  "story_urban": "Village",
  "story_social": "Middle-class"
}