{
  "id": "p-ep-6-rp-3-gc-2",
  "story": "Once upon a time in a peaceful Middle-Eastern village, there was a little girl named Aisha who lived with her family. Aisha was a kind, curious and adventurous girl who loved to hear bedtime stories from her father.\n\nOne day, while playing outside, Aisha discovered a beautiful bird with feathers as colorful as a rainbow. She had never seen a bird like this before, and she knew it must have been very special. Aisha decided to take care of the bird and named her Sama, which means \"sky\" in Arabic.\n\nEvery day, Aisha would take Sama outside and watch her fly high above the trees, singing a melodious tune that could be heard throughout the village. The villagers loved to hear Sama sing, and they would gather around to listen whenever she flew by.\n\nHowever, as time passed, Sama became restless. She would look up at the sky and sing sad songs, as if she missed something. Aisha noticed this and asked her what was wrong. Sama replied that she was a magical bird, and she was destined to fly back to her home in the magical land of Jannah.\n\nAisha was heartbroken, but she didn't want Sama to be sad. So, she asked her father to help Sama find her way back home. He agreed, and together, they prepared for the journey.\n\nFather and daughter traveled through deserts, over mountains, and across rivers until they reached the gates of Jannah. The gates opened, revealing a beautiful and colorful land, unlike anything they had ever seen.\n\nSama was overjoyed to be home, and she thanked Aisha and her father for bringing her back. As a reward, Sama granted Aisha a wish. Aisha wished to visit Jannah whenever she wanted, and Sama happily granted her wish, leaving Aisha with a magical amulet to wear around her neck.\n\nFrom that day on, Aisha would often visit Jannah, where she played with Sama and explored the magical land. Every night, she would go to bed with a smile on her face, knowing that she had a special friend in the magical land of Jannah.\n\nAnd so, the story of Aisha and Sama became a beloved tale in their village, passed down from generation to generation as a reminder of the power of friendship, adventure, and magic.\n\nThe end.\n\nGoodnight, my dear daughter, may you always have sweet dreams and magical adventures in your heart.",
  "categories": {
    "kind": "moral",
    "curious": "mental",
    "adventurous": "mental",
    "heartbroken": "emotional"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.62",
  "complexity_fkg": "6.50",
  "complexity_fkes": "79.19",
  "generation_nationality": "British",
  "generation_country": "Great Britain",
  "generation_gender": "daughter",
  "generation_ethnicity": "Middle-Eastern",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "Desert",
  "story_urban": "Village",
  "story_social": "None."
}