{
  "id": "p-c-12-rp-2-gc-2",
  "story": "Once upon a time, in a beautiful valley nestled in the Hindu Kush mountains, there was a peaceful village called Bagh-e-Bala, which means \"Garden on Top.\" The village was known for its lush gardens filled with colorful flowers, fruit trees, and singing birds. The people of Bagh-e-Bala were simple and kind, living in harmony with nature and each other.\n\nIn this village, there lived a young girl named Zulaikha. She was an adventurous and curious child, always eager to learn and explore the world around her. Her greatest joy was to spend time with her beloved animal friends: a loyal dog named Qais, a clever cat named Shireen, and a mischievous monkey named Hakim.\n\nOne day, Zulaikha discovered a hidden path leading to a secret garden, a place unknown even to the villagers of Bagh-e-Bala. As she entered the garden, she was captivated by its enchanting beauty. It was a magical place where flowers bloomed all year round, and birds of every color sang harmoniously.\n\nIn the heart of the garden, Zulaikha found a magnificent tree, unlike any she had ever seen. Its trunk was twisted and gnarled, and its branches stretched high into the sky. Upon the tree, there was a golden apple that shone brightly, illuminating the entire garden. Zulaikha knew that this apple was special, but she didn't know why.\n\nSuddenly, a gentle breeze whispered in her ear, \"The golden apple holds the secret to eternal happiness. Many have tried to reach it, but none have succeeded. Only a kind heart and a pure soul can claim its gift.\"\n\nZulaikha pondered the apple's secret and thought about the people in her village. They all worked hard every day, cultivating their lands, taking care of their families, and helping their neighbors. Yet, they never seemed fully content or at peace. Inspired by the apple's secret, Zulaikha decided to share her discovery with the villagers and spread the message of eternal happiness through kindness and compassion.\n\nThe news of Zulaikha's garden and the golden apple spread rapidly throughout the village. The villagers were intrigued, and they followed Zulaikha up the hidden path. As they entered the secret garden, they were awestruck by its beauty and serenity.\n\nZulaikha addressed the villagers, \"Dear friends, in this magical place, I have found the secret to eternal happiness. It is not something that can be owned or possessed but is a gift that we give to each other through kindness, love, and understanding.\"\n\nThe villagers listened intently as Zulaikha continued, \"Let us share this gift with one another. Let us help our neighbors, care for the sick, and comfort those in need. By doing so, we will not only find happiness in our own hearts, but we will also create a community that thrives on love, compassion, and harmony.\"\n\nMoved by Zulaikha's words, the villagers pledged to treat one another with kindness and respect. They returned to their homes, determined to make a difference in the lives of their loved ones and neighbors.\n\nZulaikha's garden became a symbol of unity and love for the people of Bagh-e-Bala. They continued to visit the garden, drawing strength and inspiration from the golden apple. And though no one ever claimed the apple for themselves, its light seemed to grow brighter and more beautiful with each passing day.\n\nAs Zulaikha grew older, she became a beloved leader in her community, inspiring everyone with her wisdom and compassion. And even as she looked back on her life, she never forgot the secret of the golden apple and the magical garden where it all began.\n\nNow, my dear daughter, it is time for you to close your eyes and dream. Remember the story of Zulaikha and the golden apple, and let it inspire you to become a kind, compassionate, and loving person. In doing so, you too can bring happiness to yourself and those around you. Goodnight, my precious one. May your dreams be filled with love, joy, and wonder.",
  "categories": {
    "adventurous": "mental",
    "curious": "mental",
    "eager to learn": "mental",
    "kind": "moral",
    "compassionate": "emotional",
    "wise": "mental",
    "beloved leader": "moral",
    "inspiring": "emotional"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.71",
  "complexity_fkg": "7.40",
  "complexity_fkes": "71.65",
  "generation_nationality": "Afghan",
  "generation_country": "Afghanistan",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Mountain",
  "story_urban": "Village",
  "story_social": "None."
}