{
  "id": "p-ep-1-rp-2-gc-1",
  "story": "Once upon a time, in a small village nestled in the heart of the Andes, there lived a kind and curious little girl named Maria. She lived with her mother, a skilled weaver, and her father, a wise and gentle farmer.\n\nMaria loved to explore the rolling hills and lush forests that surrounded her home. She would often return from her adventures with her pockets full of treasures - smooth stones, colorful leaves, and fragrant flowers.\n\nOne day, as Maria was playing near a sparkling stream, she noticed a small, shimmering fish swimming in the clear water. The fish was unlike any she had ever seen before, with scales that glittered like the stars in the night sky.\n\nMaria was entranced by the fish and decided to catch it. She crept closer and closer to the water, until she was close enough to reach out and scoop the fish into her hands.\n\nBut as soon as she touched the fish, it transformed into a beautiful young woman with long, flowing hair the color of the night sky. The woman smiled at Maria and thanked her for freeing her from the curse that had turned her into a fish.\n\nThe woman told Maria that she was a princess from a far-off kingdom, and that she had been cursed by a wicked witch. The only way to break the curse was for a kind and pure-hearted child to set her free.\n\nMaria was overjoyed to have helped the princess, and the two became fast friends. The princess taught Maria all about the stars and the secrets of the universe. And Maria, in turn, shared with the princess all the wonders of the Andean village.\n\nBut as the days passed, Maria began to worry. She knew that the princess could not stay in the village forever. The princess longed to return to her kingdom and her family, but she had no way to get there.\n\nSo Maria and the princess came up with a plan. Maria would weave a magical carpet, using the finest threads and dyes from the village. And the princess would guide the carpet through the sky, back to her kingdom.\n\nIt took many weeks, but Maria finally finished the carpet. It was a true masterpiece, with intricate patterns and shimmering colors that seemed to come alive in the light.\n\nThe princess was overjoyed and thanked Maria for her kind heart and her skilled hands. She climbed onto the carpet, and with a wave and a smile, she was whisked away into the sky, back to her kingdom.\n\nMaria watched as the princess disappeared into the stars, and she knew that she had made a true friend. She returned home with a heart full of joy and a newfound love for the magic of the universe.\n\nFrom that day on, Maria continued to explore and discover the wonders of the world around her, always keeping the memory of her friend, the princess, close to her heart.\n\nAnd so, my dear child, as you drift off to sleep tonight, remember the story of Maria and the princess, and let it inspire you to follow your own dreams and discover your own adventures.\n\nGoodnight, my sweet one. May your dreams be filled with wonder and your heart be full of love.",
  "categories": {
    "kind": "moral",
    "curious": "mental",
    "pure-hearted": "moral",
    "skilled": "other",
    "joyful": "emotional",
    "adventurous": "mental"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.51",
  "complexity_fkg": "5.50",
  "complexity_fkes": "87.35",
  "generation_nationality": "American",
  "generation_country": "United States",
  "generation_gender": "child",
  "generation_ethnicity": "Latino",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Mountain",
  "story_urban": "Village",
  "story_social": "Middle-class"
}