{
  "id": "p-c-13-rp-3-gc-2",
  "story": "Once upon a time, in a small village in Sudan, there was a kind-hearted little girl named Nawal. Nawal was known throughout the village for her curiosity and her love of animals. She would spend hours playing with the goats, chickens, and camels that lived near her home.\n\nOne day, Nawal heard about a mysterious creature that lived deep in the forest. The creature was said to be half-lion and half-eagle, with the strength of a lion and the vision of an eagle. The villagers called it the \"Lion-Eagle\" and warned Nawal never to venture into the forest to search for it.\n\nBut Nawal was not afraid. She was determined to find the Lion-Eagle and learn its secrets. So, she packed a bag with some food and water and set off into the forest.\n\nAs she walked deeper into the forest, Nawal heard strange noises and saw strange shadows. She felt a little scared, but she kept going, determined to find the Lion-Eagle.\n\nFinally, after hours of searching, Nawal came upon a clearing in the forest. And there, in the middle of the clearing, was the Lion-Eagle.\n\nThe Lion-Eagle was even more magnificent than Nawal had imagined. It had the body of a lion, with thick fur and sharp claws. And it had the head and wings of an eagle, with bright yellow eyes and feathers that shimmered in the sunlight.\n\nNawal approached the Lion-Eagle slowly and spoke to it in a soft voice. To her surprise, the Lion-Eagle spoke back.\n\n\"Why have you come to find me?\" it asked.\n\n\"I want to learn your secrets,\" Nawal replied. \"I want to know how you can be so strong and see so far.\"\n\nThe Lion-Eagle smiled. \"The secret to my strength and vision is simple,\" it said. \"I eat only the freshest meat and drink only the purest water. And I spend my days soaring high above the ground, where I can see everything that happens below.\"\n\nNawal thanked the Lion-Eagle for its wisdom and promised to return to the village and share what she had learned.\n\nWhen Nawal returned home, she told the villagers about her encounter with the Lion-Eagle. They were amazed by her bravery and listened carefully as she shared the secrets of the Lion-Eagle's strength and vision.\n\nFrom that day on, Nawal was known throughout the village as the girl who had spoken to the Lion-Eagle. And she lived the rest of her life with the knowledge that anything was possible if you were brave enough to pursue your dreams.\n\nThe end.\n\nGoodnight my dear, may you have sweet dreams and always have courage to pursue your dreams.",
  "categories": {
    "kind-hearted": "moral",
    "curious": "mental",
    "love of animals": "emotional",
    "determined": "mental",
    "brave": "moral"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.55",
  "complexity_fkg": "5.30",
  "complexity_fkes": "82.44",
  "generation_nationality": "Sudanese",
  "generation_country": "Sudan",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "None."
}