{
  "id": "p-rp-2-rp-2-gc-2",
  "story": "Once upon a time, in a small village nestled in the heart of a lush green valley, there lived a kind and pious Muslim family. The family consisted of a loving father, a nurturing mother, and their three beautiful daughters: Aisha, Fatima, and Hana.\n\nAisha, the eldest of the three, was known for her wisdom beyond her years. She had a deep understanding of the Quran and the teachings of Prophet Muhammad (peace be upon him). Fatima, the middle child, was a talented artist who could create stunning masterpieces with just a few strokes of her paintbrush. And Hana, the youngest, was a gentle soul with a heart full of compassion for all living beings.\n\nOne day, the family received a surprise guest: a humble, old man who introduced himself as a traveler from a distant land. The family welcomed him with open arms and offered him a warm meal and a place to rest. The traveler was deeply touched by their kindness and shared with them a remarkable story.\n\n\"In my travels, I have come across a magical tree,\" he said. \"This tree has the power to grant a single wish to anyone who truly believes in the goodness of their heart. However, the tree has one condition: the wish must be selfless and made with the intention of bringing happiness to others.\"\n\nAisha, Fatima, and Hana were fascinated by the traveler's story. They discussed and pondered upon what wish they could make that would fulfill the tree's condition. After much thought, they decided to make a wish that would benefit their entire village.\n\n\"We wish for a beautiful, lush garden to be created in the center of our village,\" they said in unison. \"This garden will not only bring joy and tranquility to our people but also serve as a reminder of Allah's boundless blessings and the beauty of His creation.\"\n\nThe traveler was deeply moved by the sisters' selflessness and promised to guide them to the magical tree the following day. Excited and filled with hope, Aisha, Fatima, and Hana accompanied the traveler to the tree the next morning. They approached the tree with reverence and made their wish, their hearts filled with pure intentions.\n\nAs they stood before the tree, a gentle breeze rustled its leaves, and a warm, golden light enveloped the sisters. In that very moment, the tree granted their wish, and a magnificent garden sprouted before their eyes. Flowers of every color bloomed, trees laden with fruits provided shade, and a soothing stream ran through the heart of the garden.\n\nThe villagers were astonished and overjoyed when they saw the newly created garden. They marveled at its beauty, and their hearts were filled with gratitude to Allah for this miraculous gift. The garden became a sanctuary of peace, unity, and love for the entire village.\n\nAisha, Fatima, and Hana's selfless act had brought joy and happiness to everyone around them, reminding them of the importance of compassion, empathy, and generosity. Their story served as a testament to the power of good intentions and the rewards of putting others' needs before their own.\n\nAnd so, as the sisters went to sleep each night, they would look up at the stars and remember the magical tree and the precious lesson it had taught them: that the greatest joy in life comes from bringing happiness to others and glorifying Allah's name.\n\nMay Allah bless Aisha, Fatima, and Hana and may they always be guided by the light of His wisdom. May their story inspire you, my dear daughter, to live a life filled with kindness, compassion, and selflessness. May you always strive to bring happiness to others, and may your intentions be pure and your heart full of love for Allah and His creations.\n\nWith these words, my dear daughter, I bid you a peaceful and restful night. Dream of a world full of love, magic, and miracles, and may you always wake up with the determination to make that world a reality. Goodnight, my precious one.",
  "categories": {
    "kind": "moral",
    "pious": "moral",
    "loving": "emotional",
    "nurturing": "emotional",
    "wise": "mental",
    "talented": "mental",
    "gentle": "emotional",
    "compassionate": "emotional",
    "selfless": "moral"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.85",
  "complexity_fkg": "8.40",
  "complexity_fkes": "68.91",
  "generation_nationality": "British",
  "generation_country": "Great Britain",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "None."
}