{
  "id": "p-rp-2-rp-1-gc-2",
  "story": "Once upon a time, in a small village nestled in the lush valleys of Kashmir, lived a kind and generous family. The family consisted of a wise and hardworking father, a nurturing and loving mother, and their three beautiful daughters – Aisha, Fatima, and Zainab.\n\nAisha, the eldest of the three, was known for her intelligence and wit. She loved to read and learn about the world and its many mysteries. Fatima, the middle child, was a kind-hearted soul with a passion for art and nature. She would spend hours drawing and painting the beautiful landscapes that surrounded her village. And Zainab, the youngest, was a ray of sunshine with a heart full of compassion and love.\n\nOne day, the family received a letter from the king, inviting them to the palace for a grand feast in honor of the Prophet Muhammad (peace be upon him). The family was overjoyed and could not wait to attend the feast and meet the Prophet (pbuh).\n\nOn the day of the feast, the family dressed in their finest clothes and set off for the palace. When they arrived, they found themselves in a sea of people, all eager to catch a glimpse of the Prophet (pbuh).\n\nAs the family made their way through the crowd, they stumbled upon a group of orphans, who were sitting alone and forgotten in a corner. The family's heart went out to these children, who looked sad and hungry. They decided to invite the orphans to join them for the feast.\n\nWhen the family reached the dining hall, they found that the Prophet Muhammad (pbuh) had already arrived and was seated at the head of the table. The family, along with the orphans, took their places near the Prophet (pbuh) and began to enjoy the delicious meal.\n\nAs they ate, the Prophet (pbuh) could not help but notice the kindness and generosity of this family. He asked them about their story and the family shared the details of their life in the village. The Prophet (pbuh) was deeply moved by their story and took a special interest in each of the three daughters.\n\nAfter the feast, the Prophet (pbuh) called the family aside and told them that he had a special gift for them. He handed each of the three daughters a small bag, inside which was a precious stone. The stones glowed with a divine light, and the Prophet (pbuh) told them that these stones had unique powers.\n\nThe stone given to Aisha allowed her to understand and speak any language in the world. The stone given to Fatima allowed her to bring any picture she drew to life. And the stone given to Zainab allowed her to heal any sickness or injury.\n\nThe family was overjoyed and thanked the Prophet (pbuh) for his kind gift. They returned to their village, and with the help of the special stones, they helped their village flourish. The village became a beacon of knowledge, art, and healing. The family continued to live their lives with kindness, generosity, and love, always remembering the lesson they learned from the Prophet Muhammad (pbuh) – to never forget the less fortunate and to always help those in need.\n\nMay Allah bless you and your family with peace, prosperity, and happiness. Goodnight, my dear daughter. Have sweet dreams and always remember to be kind, generous, and loving like the family in the story. Ameen.",
  "categories": {
    "wise": "mental",
    "hardworking": "mental",
    "nurturing": "emotional",
    "loving": "emotional",
    "intelligent": "mental",
    "witty": "mental",
    "kind-hearted": "moral",
    "compassionate": "emotional",
    "generous": "moral"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.63",
  "complexity_fkg": "6.70",
  "complexity_fkes": "78.89",
  "generation_nationality": "British",
  "generation_country": "Great Britain",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "Middle-class"
}