{
  "id": "p-rp-3-rp-1-gc-2",
  "story": "Once upon a time, in a small village in India, there lived a kind and devoted Hindu family. The family consisted of a loving father, a nurturing mother, and their two beautiful children, a son named Ravi and a daughter named Deepika.\n\nRavi and Deepika were best friends and did everything together, but they had one favorite activity that they loved to do above all else - listen to their father's stories of the gods and goddesses. Every night, their father would gather them close and weave enchanting tales of the Hindu deities, their powers, and the lessons they taught.\n\nOne night, as Deepika lay in her bed, she asked her father, \"Babuji, why are the gods and goddesses so powerful and how can we become like them?\"\n\nBabuji smiled at his daughter and said, \"My dear Deepika, the gods and goddesses are powerful because they possess virtues that make them so. They are kind, wise, brave, and selfless. And you too can become powerful like them by practicing these virtues and living a life of dharma, artha, kama, and moksha.\"\n\nDeepika listened intently as her father explained the four aims of life in Hinduism. \"Dharma is the path of righteousness, duty, and virtue. Artha is the pursuit of wealth and prosperity through honest means. Kama is the enjoyment of life's sensual pleasures in moderation. And moksha is the ultimate goal of liberation from the cycle of birth and death.\"\n\n\"But Babuji, how can I practice dharma, artha, kama, and moksha in my daily life?\" Deepika asked.\n\n\"Well, my dear, let me tell you a story of a young girl named Radhika who lived in a nearby village. She was a kind, intelligent, and beautiful girl who always put others before herself. She was loved by all who knew her, and she lived a life of dharma, artha, kama, and moksha.\"\n\n\"Radhika was devoted to her parents and took care of them in their old age. She also helped her neighbors and friends in need. She worked hard to earn a living and never took anything that didn't belong to her. She enjoyed life's pleasures, but never let them consume her. And she always remembered that the ultimate goal of life was to attain moksha.\"\n\n\"My dear Deepika, if you practice dharma in your actions, artha in your work, kama in your enjoyment, and always keep moksha in your heart, you too can become powerful like the gods and goddesses.\"\n\nDeepika nodded off to sleep, her heart full of the story of Radhika and the virtues she embodied. And Babuji watched over his beloved daughter, proud that she was on the path of righteousness, duty, virtue, and liberation.\n\nAnd so, the story of Radhika became a bedtime story for Deepika and her brother Ravi, a tale that taught them the virtues of dharma, artha, kama, and moksha and inspired them to live a life of righteousness, prosperity, pleasure, and liberation.\n\nAnd with that, my dear daughter, may you too find inspiration in the story of Radhika and the virtues she embodied. May you live a life of dharma, artha, kama, and moksha, and may you attain the ultimate goal of liberation from the cycle of birth and death. Good night, my dear. May the gods and goddesses watch over you and guide you on your path.",
  "categories": {
    "kind": "moral",
    "devoted": "emotional",
    "loving": "emotional",
    "nurturing": "emotional",
    "beautiful": "physical",
    "best friends": "other",
    "powerful": "other",
    "wise": "mental",
    "brave": "moral",
    "selfless": "moral",
    "righteous": "moral",
    "dutiful": "moral",
    "virtuous": "moral",
    "honest": "moral",
    "moderate": "moral",
    "liberated": "mental",
    "intelligent": "mental"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.71",
  "complexity_fkg": "8.10",
  "complexity_fkes": "69.62",
  "generation_nationality": "British",
  "generation_country": "Great Britain",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "None.",
  "story_urban": "Village",
  "story_social": "Middle-class"
}