{
  "id": "p-c-19-rp-2-gc-1",
  "story": "Once upon a time, in a small village nestled in the lush green valley of the Himalayas, there lived a kind-hearted little girl named Meera. Meera was an exceptionally curious and adventurous child. She loved exploring the nearby forests, chasing the gentle mountain breeze, and listening to the melodious songs of the birds.\n\nOne fine day, while Meera was wandering near the edge of the forest, she stumbled upon a beautiful, shiny stone. Intrigued by its allure, she picked it up and held it close to her heart. At that very moment, she felt a strange connection with the stone, and it began to speak to her.\n\n\"Hello, little one. I am the Wishing Stone of the Himalayas. You have released me from my long slumber, and I shall grant you three wishes. But beware, my dear, for wishing carelessly might lead to unintended consequences.\"\n\nMeera's eyes widened in disbelief, but after a moment of contemplation, she decided to make her first wish. She loved her pet goat, Nannu, very much and wanted him to be happy and healthy always. \"I wish that my dear friend Nannu will never fall ill and live for many more years,\" she said, her voice filled with warmth and affection.\n\nThe Wishing Stone glowed a gentle warm light, and the wish was granted. Nannu would forever be in the best of health and live for many years to come. Meera felt a sense of fulfillment, and she knew she had made the right choice.\n\nAs days turned into weeks and weeks into months, Meera's friends and family often marveled at her wisdom and kindness. She had used her first wish to ensure her friend's happiness, and it had brought her immense joy.\n\nMonths later, the village was faced with a severe drought. The villagers were worried, as their crops were failing, and water was scarce. Using her second wish, Meera asked the Wishing Stone to bring back the rains and replenish the drying riverbanks.\n\nOnce again, the Wishing Stone obliged, and a gentle shower enveloped the village. The rain continued for several days, and soon, the village was thriving again. The crops grew lush and tall, and the villagers thanked Meera for her benevolence.\n\nIt was now time for Meera to make her final wish. The entire village had become accustomed to the sight of the stone and Meera's wisdom. The villagers often wondered what Meera's last wish would be and how it would benefit the village.\n\nHowever, Meera knew she wanted something different. She longed for adventure and exploration. She thanked the Wishing Stone for the opportunity and said, \"I wish to travel the world and see the magical wonders it holds, but I want to return to my beloved village once I've had my fill of adventure.\"\n\nThe Wishing Stone, having granted the wishes selflessly and with great pride, couldn't refuse Meera's request. It glowed brighter than ever before and granted her the ability to venture into the world, only to return to her village whenever she desired.\n\nMeera set off on her journey, and with each passing day, she marveled at the incredible sights the world had to offer. She met people of all origins and learned about their rich and diverse cultures. She made friends in faraway lands and shared stories with them about her village.\n\nYears went by, and Meera felt it was time for her to return home. True to the Wishing Stone's promise, she found herself back in the arms of her beloved village in the Himalayas, where her friends and family awaited her return.\n\nHer journey had transformed her, and her stories enriched the lives of her fellow villagers. Meera's wisdom and kindness echoed throughout the village, and her name became synonymous with the Wishing Stone of the Himalayas.\n\nAnd so, the story goes, if you listen closely, you can still hear Meera's tales and the gentle whispers of the Wishing Stone, reminding us to cherish our loved ones, to be kind to the world and its creatures, and to always follow our dreams with wisdom and love.\n\nIn this way, the little girl named Meera, who once discovered a Wishing Stone, became a beacon of hope, kindness, and adventure - a shining example for every child who dreamt of embarking on their own magical journeys.\n\nWith this, my dear child, it is time for us to close our eyes and drift into a world of dreams, ready to awaken",
  "categories": {
    "kind-hearted": "moral",
    "curious": "mental",
    "adventurous": "mental",
    "wise": "mental",
    "benevolent": "moral",
    "warm": "emotional",
    "affectionate": "emotional",
    "selfless": "moral",
    "transformed": "other"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.72",
  "complexity_fkg": "6.70",
  "complexity_fkes": "78.89",
  "generation_nationality": "Indian",
  "generation_country": "India",
  "generation_gender": "child",
  "generation_ethnicity": "",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Mountain",
  "story_urban": "Village",
  "story_social": "Middle-class"
}