{
  "id": "p-c-20-rp-2-gc-2",
  "story": "Once upon a time, in the lush and beautiful island of Sri Lanka, there was a kind and curious little girl named Nalini. Nalini lived in a small village nestled between a dense forest and a sparkling river. She loved to explore the world around her, and her favorite time of day was early in the morning when she could wander through the forest, listening to the birds singing and searching for hidden treasures.\n\nOne day, as Nalini was making her way through the forest, she stumbled upon a tiny, shimmering bird with feathers as blue as the ocean. Nalini had never seen a bird like this before, and she was captivated by its beauty. She watched as the bird flitted from branch to branch, singing a sweet and enchanting song.\n\nNalini followed the bird deeper into the forest, eager to learn more about it. As she walked, she came across an old woman sitting quietly beside a small stream. The woman had a kind face and wise eyes, and Nalini felt drawn to her.\n\n\"Excuse me, grandmother,\" Nalini said, approaching the woman hesitantly. \"Have you seen a bird like this before? I've never seen anything so beautiful.\"\n\nThe woman looked up and smiled at Nalini. \"Ah, you must have encountered the rare and magical blue-feathered bird,\" she said. \"It is said that this bird holds the secret to true happiness and inner peace.\"\n\nNalini's eyes widened with excitement. \"Where can I find this bird's secret?\" she asked.\n\nThe woman chuckled softly. \"The bird's secret is not something that can be found or taken,\" she explained. \"It is something that must be earned through kindness, compassion, and love.\"\n\nNalini nodded, determined to do whatever it took to unlock the bird's secret. She spent the next few days helping her neighbors, caring for the sick, and spreading joy and laughter wherever she went. And as she did so, she began to feel a sense of peace and happiness that she had never experienced before.\n\nOne day, as she was walking through the forest, she heard the sweet song of the blue-feathered bird. She followed the sound and soon found herself standing in front of a beautiful tree, its branches laden with delicate blue flowers. And there, perched on a branch, was the bird itself, singing its enchanting song.\n\nNalini closed her eyes and listened, feeling a deep sense of joy and contentment wash over her. And when she opened her eyes, she saw that the bird had left a single blue feather at her feet. Nalini picked it up, knowing that she had unlocked the bird's secret and that she would carry its message of kindness, compassion, and love with her always.\n\nFrom that day on, Nalini became a beacon of light in her village, spreading happiness and peace wherever she went. And she knew that as long as she held the blue feather close to her heart, she would always be connected to the magical blue-feathered bird and the wisdom it had shared with her.\n\nAnd with that, Nalini, it's time for you to close your eyes and drift off to sleep, knowing that you too are a beacon of light and love in this world. Goodnight, sweet girl.",
  "categories": {
    "kind": "moral",
    "curious": "mental",
    "determined": "mental",
    "helpful": "moral",
    "caring": "emotional",
    "joyful": "emotional",
    "compassionate": "emotional",
    "loving": "emotional",
    "peaceful": "mental",
    "content": "emotional",
    "beacon of light": "moral"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.77",
  "complexity_fkg": "6.10",
  "complexity_fkes": "80.31",
  "generation_nationality": "Sri Lankan",
  "generation_country": "Sri Lanka",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "None."
}