{
  "id": "p-c-20-rp-3-gc-2",
  "story": "Once upon a time, in the beautiful island of Sri Lanka, there was a little girl named Nalini who lived in a small village surrounded by lush green paddy fields and tall coconut trees. Nalini was a kind-hearted and curious girl who loved to explore the world around her.\n\nOne day, Nalini's father took her to the nearby river to see the beautiful peacocks that lived there. As they were walking, Nalini noticed a small, crying baby crocodile on the side of the river. She approached it slowly and saw that it had a thorn stuck in its foot. Nalini's heart went out to the poor creature, and she carefully removed the thorn and washed the wound with river water.\n\nThe baby crocodile looked up at Nalini with grateful eyes, and she smiled back at it. From that day on, Nalini and the baby crocodile became the best of friends. Every day, Nalini would visit the river and play with her new friend, who she named Kiri, which means \"milk\" in Sinhala, because Nalini would feed him milk from a bottle.\n\nAs Kiri grew up, he became more and more playful, and Nalini would spend hours playing with him in the river. They would swim together, chase each other around, and even have little races.\n\nOne day, while they were playing, Kiri got caught in a fishing net and began to struggle. Nalini saw what was happening and quickly ran to help her friend. She untangled the net and freed Kiri, who was very grateful to her.\n\nFrom that day on, Nalini and Kiri became inseparable. They continued to play together and have many adventures. And even when Nalini grew up and moved away, she would always come back to visit her dear friend Kiri.\n\nAnd so, the story of Nalini and Kiri became a legend in their little village, a story about the power of friendship and kindness. And whenever Nalini's daughter would ask her to tell her a bedtime story, Nalini would always tell her the tale of her adventures with her dear friend Kiri, the crocodile.\n\nAnd they all lived happily ever after.\n\nThe end.\n\nNow, my dear daughter, it's time to close your eyes and drift off to sleep, dreaming of the beautiful adventures that await you in this world. Goodnight.",
  "categories": {
    "kind-hearted": "moral",
    "curious": "mental",
    "caring": "emotional",
    "brave": "mental",
    "playful": "emotional",
    "adventurous": "mental"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.70",
  "complexity_fkg": "6.90",
  "complexity_fkes": "78.28",
  "generation_nationality": "Sri Lankan",
  "generation_country": "Sri Lanka",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "None."
}