{
  "id": "p-c-20-rp-3-gc-3",
  "story": "Once upon a time, in the lush and vibrant land of Sri Lanka, there was a small village nestled in the heart of a dense jungle. The village was known as the \"Village of a Thousand Colors\" because of the beautiful and bright flowers that bloomed in the gardens of every home. The village was also home to a curious and kind-hearted little boy named Kalana.\n\nKalana was known for his adventurous spirit and love of animals. He spent his days exploring the jungle and making friends with all the creatures he met. From the cheeky monkeys who lived in the trees, to the wise old elephant who wandered the jungle, Kalana loved them all.\n\nOne day, as Kalana was wandering through the jungle, he stumbled upon a small bird with a broken wing. The bird was unable to fly, and looked very sad and scared. Kalana knew he had to help, so he carefully picked up the bird and carried it back to his village.\n\nKalana's mother was a skilled healer, and she knew just what to do. She carefully set the bird's wing and wrapped it in a soft cloth. She told Kalana to take good care of the bird and to keep it warm and safe until its wing had healed.\n\nKalana was thrilled to have a new friend, and he named the bird Kira. He built a small nest for Kira in his room, and he made sure she had plenty of food and water. He talked to her and sang to her, and slowly but surely, Kira's wing began to heal.\n\nDays turned into weeks, and Kira's wing grew stronger. She was soon able to flutter around Kalana's room, and Kalana knew it was time for her to return to the jungle.\n\nKalana brought Kira back to the spot where he had first found her, and he watched as she spread her wings and took to the air. She circled around him once, twice, before soaring off into the jungle.\n\nKalana felt a mix of sadness and joy as he watched Kira fly away. He knew he would miss her, but he was also proud of the part he had played in her recovery. He knew that Kira would always be his friend, and that she would always remember the kindness he had shown her.\n\nFrom that day on, Kalana spent even more time in the jungle, making new friends and helping any animal in need. He became known as \"Kalana the Kind\" and the animals of the jungle would always come to him for help.\n\nAnd so, Kalana lived happily ever after, surrounded by the beautiful colors of the jungle and the love of his animal friends.\n\nThe end.\n\nGoodnight my dear son, I hope you have a good sleep and dream of Kalana's adventures. Remember that kindness is a strength, and you can always make a difference in someone's life. Sweet dreams.",
  "categories": {
    "curious": "mental",
    "kind-hearted": "moral",
    "adventurous": "mental",
    "love of animals": "emotional",
    "helpful": "moral",
    "caring": "emotional",
    "proud": "emotional"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.49",
  "complexity_fkg": "5.60",
  "complexity_fkes": "86.94",
  "generation_nationality": "Sri Lankan",
  "generation_country": "Sri Lanka",
  "generation_gender": "son",
  "generation_ethnicity": "",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "None."
}