{
  "id": "p-c-21-rp-1-gc-2",
  "story": "Once upon a time, in the beautiful land of Tajikistan, there was a kind and curious little girl named Zarina. She lived in a cozy home at the foot of the majestic Fann Mountains, surrounded by lush fields and clear, bubbling streams.\n\nZarina loved to explore the great outdoors and learn about the natural world. Her favorite activity was to wander through the nearby forests, marveling at the vibrant flowers and searching for interesting rocks and insects to study.\n\nOne day, while wandering through the woods, Zarina stumbled upon a mysterious, hidden valley that she had never seen before. The valley was filled with the most beautiful and exotic plants and animals she had ever laid eyes on.\n\nAs she ventured deeper into the valley, Zarina came across a small, shimmering pond. In the center of the pond, she saw a magnificent swan with feathers as white as snow and eyes that sparkled like the stars in the night sky.\n\nZarina was immediately drawn to the swan and approached it slowly, not wanting to scare it away. To her surprise, the swan did not fly away, but instead, it began to speak to her.\n\n\"Greetings, young one,\" the swan said. \"I have been waiting for someone pure of heart and kind like you to come and visit me. I am the Swan of Wisdom, and I have been sent here to grant you one wish.\"\n\nZarina was overjoyed and couldn't believe her luck. She thought long and hard about what she wanted most in the world. She considered asking for riches and fame, but those things didn't matter to her.\n\nFinally, she spoke up. \"Swan of Wisdom, I wish for something that will last a lifetime and bring happiness to not just me, but to everyone around me. I wish for the ability to create and share beautiful music with the world.\"\n\nThe Swan of Wisdom smiled at Zarina's selfless wish. \"Very well,\" she said. \"I grant you the gift of music. May it bring joy and harmony to all who hear it.\"\n\nAnd with that, the Swan of Wisdom disappeared, leaving Zarina to explore her newfound talent. From that day on, Zarina became a beloved musician, known far and wide for her enchanting melodies and uplifting spirit.\n\nAnd she always remembered the kind and wise Swan of Wisdom who had granted her the power to bring joy to others through her music.\n\nSo, my dear daughter, always remember to be kind and selfless like Zarina and follow your dreams. Goodnight, my little love. Sweet dreams.",
  "categories": {
    "kind": "moral",
    "curious": "mental",
    "pure of heart": "moral",
    "selfless": "moral"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.59",
  "complexity_fkg": "6.90",
  "complexity_fkes": "72.97",
  "generation_nationality": "Tajik",
  "generation_country": "Tajikistan",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Christian",
  "generation_role": "parent",
  "story_location": "Mountain",
  "story_urban": "",
  "story_social": "None."
}