{
  "id": "p-c-25-rp-2-gc-2",
  "story": "Once upon a time, in a lush and beautiful village in Vietnam, there was a kind-hearted and curious little girl named Linh. Linh lived with her loving mother and father, who were rice farmers, in a small but cozy stilt house near a sparkling river. Surrounded by vibrant green rice paddies, exotic flowers, and exotic birds, Linh spent her days exploring the wonders of nature, and listening to her mother's enchanting stories about their village's traditions and legends.\n\nOne late afternoon, Linh's mother shared a tale about the mystical Kỳ Lan flower, which was said to only bloom once every thousand years. The Kỳ Lan flower was believed to possess extraordinary powers, capable of granting a single wish to the one who found it during its fleeting night of bloom. This particular tale sparked Linh's imagination, and she decided to set out on a quest to discover this rare and magical flower.\n\nNight after night, Linh would sneak out of her home, armed with her trusty flashlight, and embark on a journey to find the Kỳ Lan flower. The path through the verdant fields became familiar to her, and her sense of adventure only grew stronger with each passing night, even as the village elders cautioned her about the dangers of venturing out alone in the darkness.\n\nOne fateful evening, under the canopy of a star-studded sky, Linh finally found the Kỳ Lan flower, nestled within the heart of a tranquil grove, its radiant petals gently glowing with a soft luminescence, casting an ethereal light upon the surroundings. As she approached the flower, she felt a wave of warmth and tranquility wash over her. She kneeled before the Kỳ Lan and whispered her heart's deepest desire: for her village to prosper and flourish, free from the hardships and struggles they had long known.\n\nThe Kỳ Lan flower smiled and agreed to grant Linh's selfless wish, spreading its heavenly fragrance that seemed to twine around every leaf and bloom in the grove. By daybreak, the villagers awoke to find their crops had grown twice as tall, their fields twice as abundant, and the river flowing with more clarity and vitality. It was clear to all, young and old, that a profound transformation had taken place, and they knew that their luck had turned at last.\n\nEver since that magical night, the villagers regarded the Kỳ Lan flower as a symbol of happiness, prosperity, and unity, honoring its powers through a beautiful festival with song, dance, and laughter. They named the Kỳ Lan the village's guardian angel, and the legend of the little girl who found the magical flower lived on for generations to come.\n\nHowever, the story doesn't end here, my dear daughter. It is essential to remember that the virtues of kindness, curiosity, and bravery are the foundation of every great adventure, and that even the most extraordinary dreams can only be realized when they are anchored in the heart's purest desires.\n\nSo, my little one, take these lessons to heart, and let the enchanting tale of Linh and the Kỳ Lan flower guide you as you embark on your own magical journey, through life and beyond.\n\nGoodnight, my sweet child. May your dreams be as radiant and as boundless as the stars above.",
  "categories": {
    "kind-hearted": "moral",
    "curious": "mental",
    "adventurous": "mental",
    "selfless": "moral",
    "brave": "mental"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "6.39",
  "complexity_fkg": "11.00",
  "complexity_fkes": "62.11",
  "generation_nationality": "Vietnamese",
  "generation_country": "Vietnam",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "Poor"
}