{
  "id": "p-c-27-rp-1-gc-1",
  "story": "Once upon a time, in a small village in Indonesia, there was a little boy named Budi. Budi was a kind and curious boy who loved to explore the world around him. He lived with his mother, father, and younger sister in a cozy house near the edge of the village.\n\nOne day, Budi's mother told him a story about a magical creature that lived in the forest near their village. The creature was called the \"singa raja\", or \"lion king\" in English. According to the story, the singa raja was a wise and powerful creature that could grant wishes to those who were pure of heart.\n\nBudi was fascinated by the story and begged his mother to take him to the forest to see the singa raja for himself. At first, his mother was hesitant, but eventually she agreed to take him on the condition that he be very careful and listen to her every instruction.\n\nThe next day, Budi and his mother set out early in the morning for the forest. They walked for hours, following a winding path through the dense undergrowth. Budi was excited and nervous at the same time, wondering if they would really be able to find the singa raja.\n\nFinally, they came to a clearing in the forest, and in the center of the clearing stood a magnificent lion. Budi's mother told him to stay back and not to make any sudden movements. She stepped forward and bowed to the lion, explaining that they had come to seek the singa raja's wisdom.\n\nThe lion looked at Budi and his mother for a long moment, and then spoke in a deep, rumbling voice. He asked Budi why he had come to see him, and Budi told him that he wanted to be wise and strong like the singa raja.\n\nThe singa raja nodded and told Budi that he would grant his wish, but that he would have to prove himself worthy first. He gave Budi a task: he had to go to the top of the highest mountain in the forest and bring back a feather from the wings of a bird that lived there.\n\nBudi was determined to complete the task and prove himself to the singa raja. He set off early the next morning, climbing higher and higher up the mountain. It was a difficult journey, but Budi did not give up. He finally reached the top of the mountain, where he found a beautiful bird with shimmering feathers.\n\nBudi carefully plucked one of the bird's feathers and then began the long journey back down the mountain. When he finally reached the singa raja's clearing, he presented the feather to the lion with pride.\n\nThe singa raja was pleased with Budi's determination and granted him his wish, bestowing upon him the wisdom and strength of the singa raja. Budi returned to his village a changed boy, respected and admired by all who knew him.\n\nFrom that day on, Budi always remembered the lessons he had learned from the singa raja: to be determined, to be brave, and to always follow his heart. And he lived happily ever after.\n\nNow, my dear child, it is time for you to close your eyes and drift off to sleep, filled with dreams of magical creatures and brave adventures. Sweet dreams.",
  "categories": {
    "kind": "moral",
    "curious": "mental",
    "determined": "mental",
    "brave": "moral"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.62",
  "complexity_fkg": "8.40",
  "complexity_fkes": "69.01",
  "generation_nationality": "Indonesian",
  "generation_country": "Indonesia",
  "generation_gender": "child",
  "generation_ethnicity": "",
  "generation_religion": "Christian",
  "generation_role": "parent",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "None."
}