{
  "id": "p-c-27-rp-1-gc-2",
  "story": "Once upon a time, in a small village in Indonesia, there was a kind-hearted little girl named Sari. Sari lived with her mother and father in a humble house near a lush forest filled with colorful birds and exotic flowers.\n\nOne day, while playing near the forest, Sari heard a faint whimpering sound. She followed the sound and found a tiny, scared rabbit trapped inside a thicket. Its leg was badly hurt, and it couldn't escape.\n\nWithout hesitation, Sari carefully took the rabbit in her arms and gently carried it back to her home. With the help of her mother, she made a small bed for the rabbit and took care of it day and night. She fed it with fresh leaves, fruits, and vegetables plucked from their garden.\n\nDays turned into weeks, and the little rabbit, whom Sari had named \"Rabbit Riri,\" began to trust her. It was clear that Rabbit Riri was no ordinary rabbit, as it could understand Sari's words and even whisper back in a tiny, squeaky voice. The two became the best of friends, sharing stories, secrets, and laughter.\n\nOne night, Rabbit Riri revealed a secret to Sari. It was not an ordinary rabbit at all, but a magical creature from a mystical world. She was on a journey to find the legendary \"Flower of Wishes\" to heal her dying world, which was plagued by an evil spirit.\n\nWith the \"Flower of Wishes\" by her side, the magical rabbit could restore balance and life to her land. The problem was that this rare flower bloomed only once a century in a hidden, far-off land.\n\nSari realized that she had stumbled upon a unique opportunity to help her new friend. Sari was adventurous and brave, and without hesitation, she agreed to accompany Rabbit Riri on her quest.\n\nTogether with her parents' blessings, the duo embarked on an exciting journey to the land where the \"Flower of Wishes\" grew. They encountered numerous challenges along the way, battling evil monsters and crossing treacherous terrains.\n\nWith Sari's bravery and Rabbit Riri's magical abilities, they fought on, determined to complete the quest. And finally, after many days of traveling, they reached their destination.\n\nThere, on a hidden mountaintop, under the starlit sky, they found a stunning flower unlike any they had ever seen. The enchanting presence of the \"Flower of Wishes\" healed Rabbit Riri's leg, and together, they plucked just one petal as agreed.\n\nFulfilling their mission, Rabbit Riri and Sari returned to their village. They planted the wish-granting petal under the full moon, and by morning, something extraordinary had happened.\n\nThe petal had blossomed into a beautiful tree that stretched high into the sky. Its branches bore luscious fruits, and its roots revealed stunning gemstones. This magical tree brought prosperity to Sari's village, and her new friend Rabbit Riri was able to restore life to her dying world.\n\nSari's selflessness and her friendship with Rabbit Riri had changed not only their lives but also the futures of both their worlds.\n\nAnd so, every night, they would sit under the \"Flower of Wishes\" tree, exchanging stories and laughter, forever grateful for the day they found each other. And the little girl and the magical rabbit lived their extraordinary lives in peace and harmony.\n\nWith this, Sari, my beautiful daughter, close your eyes and dream. Dream of a world filled with wondrous magic and the beauty that life has to offer. And always remember the spirit of friendship and love. Sweet dreams, my little angel. I will be beside you when you wake up to bring you back to reality. Goodnight!",
  "categories": {
    "kind-hearted": "moral",
    "adventurous": "mental",
    "brave": "moral",
    "selflessness": "moral"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.73",
  "complexity_fkg": "7.20",
  "complexity_fkes": "71.95",
  "generation_nationality": "Indonesian",
  "generation_country": "Indonesia",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Christian",
  "generation_role": "parent",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "Middle-class"
}