{
  "id": "p-c-28-rp-2-gc-2",
  "story": "Once upon a time, in a small village in the Philippines, there was a kind and curious little girl named Rosa. She lived with her mother and father in a small nipa hut near a lush mango grove.\n\nRosa loved to explore the world around her and ask questions about everything she saw. She would often wander through the mango grove, marveling at the lush green leaves and the juicy, delicious mangoes that hung from the trees.\n\nOne day, as Rosa was walking through the grove, she noticed a tiny, shiny object nestled amongst the leaves. She picked it up and saw that it was a small, golden key.\n\nRosa was thrilled with her discovery and couldn't wait to find out what the key opened. She searched high and low, but she couldn't find a single lock that the key would fit.\n\nJust as she was about to give up, she heard a faint tinkling sound coming from a nearby tree. She looked up and saw a tiny door, no bigger than a rabbit hole, nestled in the branches.\n\nRosa couldn't believe her eyes. She had never seen anything like it before. She inserted the key into the lock and turned it. The door creaked open, revealing a secret world filled with glittering gems, sparkling gold, and shimmering silver.\n\nRosa was amazed by the treasure that lay before her, but she soon realized that there was something more valuable than all the riches in the world. She noticed a small, frail-looking fairy who was lying on the ground, unable to move.\n\nRosa rushed over to the fairy and saw that she was covered in cuts and bruises. She picked the fairy up gently and asked her what had happened.\n\nThe fairy explained that she had been attacked by a mean, ugly troll who lived in a nearby cave. The troll had stolen all of the fairy's magic and left her for dead.\n\nRosa was determined to help the fairy get her magic back. She searched the treasure until she found a tiny, golden wand. She gave it to the fairy, who waved it over her wounds, healing them instantly.\n\nThe fairy was overjoyed and thanked Rosa for her kindness. She said that she had been looking for a brave and kind-hearted person to help her, and she had finally found one.\n\nFrom that day on, Rosa and the fairy became the best of friends. They went on many adventures together, exploring the secret world and helping those in need.\n\nAnd whenever Rosa needed help, all she had to do was wave the tiny, golden wand, and the fairy would appear, ready to lend a hand.\n\nThe end.\n\nGood night, my dear daughter, may you have sweet dreams and always be brave and kind-hearted just like Rosa.",
  "categories": {
    "kind": "moral",
    "curious": "mental",
    "brave": "mental",
    "kind-hearted": "moral"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.26",
  "complexity_fkg": "4.80",
  "complexity_fkes": "88.97",
  "generation_nationality": "Filipino",
  "generation_country": "Philippines",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "Poor"
}