{
  "id": "p-c-2-rp-2-gc-2",
  "story": "Once upon a time, in a land not too far away, there was a beautiful little girl named Lily. Lily was a kind, curious, and adventurous girl who loved to explore the world around her. She lived in a cozy cottage with her mother and father, nestled at the edge of a vast, enchanted forest.\n\nOne sunny afternoon, after finishing her chores, Lily decided to venture into the forest to find the legendary Wishing Tree. It was said that this magical tree granted a single wish to anyone who could find it, and Lily had been dreaming of making a wish for as long as she could remember.\n\nAs she entered the forest, the trees grew taller and denser, and the sunlight struggled to reach the ground. The air was filled with the sweet scent of wildflowers and the gentle hum of insects. Lily followed a winding path deeper into the woods, her heart filled with excitement and anticipation.\n\nAfter hours of walking, Lily came across a small, clearing. In the center of the clearing stood a magnificent tree, its branches laden with sparkling gem-like fruits. This had to be the Wishing Tree!\n\nLily approached the tree slowly, her eyes wide with wonder. She reached out and picked one of the shimmering fruits, feeling a surge of energy coursing through her as she did so. Suddenly, she was whisked away on a magical journey through the skies, the stars twinkling overhead like diamonds on black velvet.\n\nDuring her journey, Lily saw incredible sights: majestic mountains, vast oceans, and bustling cities filled with people of all shapes and sizes. Eventually, she found herself in front of a magnificent palace carved entirely from crystal.\n\nA kind, wise voice echoed through the palace, asking Lily to make her wish. Lily thought long and hard, considering all the things she could wish for. She could ask for a room full of toys, a wardrobe of beautiful dresses, or even a pony.\n\nBut then, it struck her. Lily realized that what she truly wanted more than anything else was for her family to be happy and healthy for the rest of their days.\n\nWith a smile on her face, Lily made her wish, and just like that, she was back in the enchanted forest, standing before the Wishing Tree. The magical fruit in her hand had transformed into a small, golden acorn, which she placed in her pocket as a keepsake.\n\nLily raced back home, filled with joy at the thought of her family's newfound happiness. When she arrived, her mother and father were waiting for her, their faces beaming with love and warmth.\n\nFrom that day on, Lily, her mother, and her father lived a life filled with laughter, joy, and adventure. They knew that their days were indeed numbered, but the love that bound them together would last for all eternity.\n\nAnd so, dear daughter, as you drift off to sleep, remember that sometimes, the most important wishes are not for ourselves, but for the ones we hold dear in our hearts. Goodnight, sweetheart. Dream of magical adventures and always remember how much you are loved.",
  "categories": {
    "kind": "moral",
    "curious": "mental",
    "adventurous": "mental"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.98",
  "complexity_fkg": "6.80",
  "complexity_fkes": "78.59",
  "generation_nationality": "British",
  "generation_country": "Great Britain",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Magical/Imaginary Places",
  "story_urban": "Village",
  "story_social": "Middle-class"
}