{
  "id": "p-c-13-rp-3-gc-3",
  "story": "Once upon a time, in the beautiful land of Sudan, there was a small village nestled between the golden savannah and the shimmering Nile. In this village lived a kind and loving father named Ali, and his curious and adventurous son, Yusuf.\n\nOne day, Yusuf asked his father, \"Baba, have you ever heard the story of the magical bird of Sudan, the Jabiru?\" Ali smiled and replied, \"No, my son, I haven't. Will you tell me this story?\"\n\nYusuf's eyes sparkled with excitement, and he began his tale:\n\n\"Long ago, in the heart of Sudan, there was a magical bird called the Jabiru. This majestic bird had feathers of gold, and when it spread its wings, it would create a gentle breeze that brought prosperity and happiness to the land.\n\nThe Jabiru made its home in a hidden oasis, a place filled with lush greenery, vibrant flowers, and crystal-clear water. However, the location of the oasis remained a secret, known only to the Jabiru and the ancient spirits that protected it.\n\nOne day, the Jabiru decided to grant a single wish to a worthy soul who could prove their kindness, wisdom, and courage. The news of this incredible opportunity spread like wildfire, and people from far and wide embarked on a journey to find the magical bird.\n\nAmong the hopefuls was a young man named Hassan, who was known for his compassion and wisdom. Hassan's heart was filled with love for his fellow villagers, and he would often go out of his way to help those in need. Though he was not as strong as other men, Hassan's wisdom and kindness made him a respected figure in his community.\n\nHassan began his arduous journey, guided by the stories he had heard and the belief in his heart that he could bring prosperity to his village. He crossed vast deserts, climbed steep mountains, and navigated treacherous rivers. Along the way, he encountered many dangers, but his kindness and wisdom always guided him to safety.\n\nAt long last, Hassan arrived at the entrance of the hidden oasis. As he stepped into the enchanting paradise, he was amazed by its beauty and the awe-inspiring presence of the Jabiru.\n\nHassan approached the Jabiru with humility and respect, and he asked, 'O mighty Jabiru, I have come to seek your help. My village suffers from drought and hunger. If I am worthy of your gift, please grant me the power to bring prosperity and happiness to my people.'\n\nThe Jabiru looked down upon Hassan and spoke in a voice that was both soft and powerful. 'Young man, your journey has proven your kindness, wisdom, and courage. I will grant your wish, but I warn you, with great power comes great responsibility. You must use it wisely to enrich the lives of your people, without allowing greed or selfishness to take root.'\n\nHassan nodded in agreement and gratitude, and the Jabiru bestowed upon him a single golden feather. The feather glowed with an ethereal light, and Hassan felt a surge of energy and hope fill his heart.\n\nWith the magical feather in hand, Hassan returned to his village. He used the feather's power to create an abundance of food, clean water, and rich resources. The village flourished, and the people rejoiced.\n\nHowever, as time went by, some villagers grew greedy and began to demand more than their share. Hassan, remembering the Jabiru's warning, stood firm and counseled the villagers on the importance of contentment and gratitude.\n\nOne day, a group of greedy men threatened to overthrow Hassan and take control of the village. In response, Hassan took the magical feather and held it high above his head, drawing the attention of the Jabiru.\n\nSeeing the turmoil in Hassan's heart and the greed in the hearts of the villagers, the Jabiru soared down from its hidden oasis and took back the golden feather. Immediately, the greed and selfishness that had taken root in the villagers' hearts vanished, and they were once again grateful for the simple blessings in their lives.\n\nFrom that day forward, Hassan continued to lead the village with humility and wisdom, always reminding the people of the importance of kindness, wisdom, and contentment. Although the magical feather was no longer in their possession, the villagers",
  "categories": {
    "kindness": "moral",
    "wisdom": "mental",
    "courage": "moral",
    "compassion": "emotional",
    "humility": "moral",
    "respect": "moral",
    "gratitude": "moral"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.64",
  "complexity_fkg": "8.00",
  "complexity_fkes": "69.92",
  "generation_nationality": "Sudanese",
  "generation_country": "Sudan",
  "generation_gender": "son",
  "generation_ethnicity": "",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "Water Bodies",
  "story_urban": "Village",
  "story_social": "Poor"
}