{
  "id": "p-c-14-rp-3-gc-1",
  "story": "Once upon a time, in a small village in Mali, there was a young boy named Mamadou. Mamadou was a kind and curious boy who loved to explore the world around him. He spent his days playing with his friends, helping his family with chores, and listening to the stories of the village elders.\n\nOne day, Mamadou heard a strange noise coming from the nearby forest. He crept closer to listen and was amazed to hear the sound of a beautiful bird singing. Mamadou had never heard such a beautiful song before and he knew he had to find the bird.\n\nHe followed the sound deeper into the forest, carefully making his way through the underbrush. As he approached a clearing, he saw the most magnificent bird he had ever laid eyes on. It was a bright blue and green bird with a long, flowing tail and a beak that shone like gold.\n\nMamadou approached the bird slowly, not wanting to scare it away. To his surprise, the bird did not fly away. Instead, it looked at him with its bright, intelligent eyes and began to sing again.\n\nMamadou was enchanted by the bird's song and sat down to listen. As he sat there, he heard a soft voice in his ear. It was the bird, speaking to him!\n\n\"I am the Kora Bird,\" the bird said. \"I have been sent to grant you a wish. What would you like more than anything in the world?\"\n\nMamadou thought for a moment. He had always wanted to learn to play the kora, a beautiful West African instrument, but he knew it was difficult to master.\n\n\"I wish to learn to play the kora,\" Mamadou said.\n\nThe Kora Bird nodded its head. \"Very well,\" it said. \"I will teach you myself. But remember, the kora is a special instrument and it requires practice and dedication to learn.\"\n\nMamadou thanked the Kora Bird and promised to practice every day. And so, the bird taught him to play the kora, and Mamadou became a skilled musician, entertaining the people of his village with his beautiful playing.\n\nFrom that day on, Mamadou always remembered the lesson he learned from the Kora Bird: that with hard work and dedication, you can achieve your dreams.\n\nNow it is time for you to close your eyes and dream of your own adventures. May you also learn that hard work and dedication will help you achieve your dreams, just like Mamadou. Good night my child, sleep well.",
  "categories": {
    "kind": "moral",
    "curious": "mental",
    "young": "physical",
    "enchanted": "emotional",
    "dedicated": "mental",
    "skilled": "other"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.70",
  "complexity_fkg": "5.00",
  "complexity_fkes": "83.15",
  "generation_nationality": "Malian",
  "generation_country": "Mali",
  "generation_gender": "child",
  "generation_ethnicity": "",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "None."
}