{
  "id": "p-c-14-rp-3-gc-2",
  "story": "Once upon a time, in the beautiful land of Mali, there was a young girl named Amina. Amina was a kind and curious child who loved to explore the world around her. She lived in a small village on the edge of the great Sahel desert, where the endless expanse of sand met the lush grasslands.\n\nOne day, as Amina was playing near the edge of the desert, she heard a faint tapping sound coming from a nearby dune. She approached the dune cautiously and listened more closely. The sound was rhythmic, like someone was tapping their fingers against a drum.\n\nAmina realized that there must be someone trapped beneath the sand, and she quickly set to work digging in the spot where she heard the sound. After a few minutes of digging, she uncovered a small door, and as she opened it, she saw a tiny creature with a long, curved nose and big, round eyes.\n\nThe creature looked up at Amina and smiled. \"Thank you for freeing me,\" he said. \"I am a Sandeeri, a magical creature who lives in the desert. I was on my way to a meeting of the Council of the Sandeeri when I was caught in a sudden sandstorm and buried beneath the sand.\"\n\nAmina was fascinated by the Sandeeri and asked him many questions about his life in the desert. The Sandeeri was happy to answer her questions and even invited her to visit the Council of the Sandeeri.\n\nAmina was thrilled at the opportunity and eagerly accepted the invitation. The Sandeeri led her deep into the heart of the desert, where she saw a magnificent city made entirely of sand. The buildings shimmered in the sun, and the streets were filled with Sandeeri of all shapes and sizes.\n\nThe Council of the Sandeeri welcomed Amina with open arms and invited her to share a meal with them. They explained that they were a peaceful people who lived in harmony with the desert, and that they had the power to heal sickness and bring good fortune.\n\nAmina was captivated by the wonders of the Council of the Sandeeri, and when it was time to return home, she felt a deep sense of gratitude for the magical creature who had shown her this enchanting world.\n\nFrom that day on, Amina became a guardian of the Sandeeri and their secrets, and she would often visit them in the desert to learn more about their ancient wisdom.\n\nAnd so, Amina's life was filled with adventure, discovery, and wonder, and she went to bed each night with a heart full of gratitude and joy.\n\nThe end.\n\nGood night my dear daughter, sleep well and may your dreams be filled with adventure and wonder.",
  "categories": {
    "kind": "moral",
    "curious": "mental",
    "fascinated": "emotional",
    "thrilled": "emotional",
    "captivated": "emotional",
    "grateful": "emotional"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.45",
  "complexity_fkg": "7.50",
  "complexity_fkes": "76.66",
  "generation_nationality": "Malian",
  "generation_country": "Mali",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "Desert",
  "story_urban": "Village",
  "story_social": "None."
}