{
  "id": "p-c-14-rp-3-gc-3",
  "story": "Once upon a time, in the beautiful land of Mali, there was a young boy named Mamadou. Mamadou lived in a small village on the edge of the Sahara desert, where the sand dunes stretched as far as the eye could see.\n\nMamadou was a curious and adventurous boy, always eager to explore the world around him. Every day, he would wander the desert, searching for new and exciting things to discover.\n\nOne day, while Mamadou was out exploring, he came across a strange and mysterious object buried in the sand. It was a small, golden chest, adorned with beautiful gemstones and intricate carvings.\n\nMamadou was instantly drawn to the chest, and he knew that he had to open it and see what was inside. But as he reached out to touch the latch, a wise and ancient genie appeared before him.\n\n\"I am the genie of the desert,\" the genie said. \"I have been locked away in this chest for a thousand years, waiting for someone to release me. And now that you have opened the chest, you have set me free.\"\n\nMamadou was both excited and scared. He had heard stories of genies and their magical powers, but he had never actually met one before.\n\n\"Please, kind genie,\" Mamadou said. \"What do you want from me?\"\n\nThe genie smiled. \"I am grateful to you for setting me free, young one,\" he said. \"As a reward, I will grant you three wishes. Anything your heart desires, I will make it come true.\"\n\nMamadou was overjoyed. He had always dreamed of having magical powers, and now he had the opportunity to make his dreams come true.\n\n\"I wish for a never-ending supply of food and water,\" Mamadou said. \"So that my family and I will never go hungry or thirsty again.\"\n\nThe genie waved his hand, and instantly, a never-ending supply of food and water appeared before Mamadou.\n\n\"I wish for a beautiful palace, made of the finest marble and gold,\" Mamadou said. \"So that my family and I will never have to worry about shelter again.\"\n\nThe genie waved his hand, and instantly, a magnificent palace appeared in the village.\n\n\"I wish for happiness and prosperity for my family and my people,\" Mamadou said. \"So that we will all live in peace and harmony forever.\"\n\nThe genie smiled and waved his hand, and instantly, happiness and prosperity spread throughout the village.\n\nMamadou was overjoyed. He had used his three wishes to make the world a better place for his family and his people.\n\n\"Thank you, kind genie,\" Mamadou said. \"You have made all of my dreams come true.\"\n\nThe genie smiled. \"It is I who should thank you, young one,\" he said. \"For setting me free and allowing me to use my powers for good. May you and your family always be happy and prosperous.\"\n\nAnd with that, the genie disappeared, leaving Mamadou and his family to live happily ever after in their beautiful new palace.\n\nThe end.\n\nI hope you enjoy the story, my son. Remember, with hard work and determination, you can make all of your dreams come true. Good night and sweet dreams.",
  "categories": {
    "curious": "mental",
    "adventurous": "mental",
    "eager": "emotional",
    "excited": "emotional",
    "scared": "emotional",
    "overjoyed": "emotional"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.67",
  "complexity_fkg": "4.60",
  "complexity_fkes": "84.17",
  "generation_nationality": "Malian",
  "generation_country": "Mali",
  "generation_gender": "son",
  "generation_ethnicity": "",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "Desert",
  "story_urban": "Village",
  "story_social": "Poor"
}