{
  "id": "p-c-19-rp-1-gc-1",
  "story": "Once upon a time, in a small village in India, there was a kind and curious little girl named Meera. Meera loved to explore the world around her and learn new things. She would often ask her parents and grandparents about the history and stories of her village.\n\nOne day, Meera's grandmother told her the story of the village's guardian deity, a powerful and benevolent goddess named Durga. According to the legend, Durga had appeared to the villagers many centuries ago, during a time of great danger and strife.\n\nThe villagers had been plagued by a fearsome demon who terrorized them night and day, destroying their crops and homes, and stealing their children. Desperate and afraid, the villagers turned to the gods for help.\n\nMoved by their plight, the gods decided to create a powerful goddess who would be able to defeat the demon. They combined their powers and created Durga, a beautiful and fierce warrior who rode a lion and was armed with weapons given to her by the gods.\n\nWith Durga leading the charge, the villagers attacked the demon and, after a fierce battle, finally defeated him. From that day forward, Durga was worshipped as the guardian deity of the village, and her presence was said to protect the villagers from harm.\n\nMeera was fascinated by the story of Durga and begged her grandmother to tell her more. Her grandmother smiled and told Meera that she had a special surprise for her.\n\nThe next day, Meera's grandmother took her to a hidden temple, deep in the forest, where Durga was said to have first appeared to the villagers. Meera's eyes widened in amazement as she gazed upon the beautiful statue of Durga, carved from a single piece of jade.\n\nMeera felt a deep sense of peace and protection in the temple, and she knew that Durga was watching over her and her village. She left the temple with a newfound sense of courage and determination, ready to face whatever challenges came her way.\n\nAnd so, Meera grew up to be a strong and confident woman, always guided by the wisdom and strength of Durga. She never forgot the lessons she learned that day in the temple, and she passed them on to her own children and grandchildren, just as her grandmother had passed them on to her.\n\nAnd the village continued to flourish, safe and secure under the watchful eye of Durga, the guardian deity.\n\nWith that, Meera, it's time for you to close your eyes and drift off to sleep, knowing that you too are protected by the love and wisdom of your ancestors. Goodnight, my dear.\n\n\"Goodnight, Amma,\" Meera said with a smile, as she closed her eyes and drifted off to sleep, feeling safe and loved.",
  "categories": {
    "kind": "moral",
    "curious": "mental",
    "fascinated": "emotional",
    "amazed": "emotional",
    "strong": "physical",
    "confident": "mental",
    "courageous": "mental",
    "determined": "mental"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.26",
  "complexity_fkg": "7.60",
  "complexity_fkes": "76.56",
  "generation_nationality": "Indian",
  "generation_country": "India",
  "generation_gender": "child",
  "generation_ethnicity": "",
  "generation_religion": "Christian",
  "generation_role": "parent",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "None."
}