{
  "id": "p-c-23-rp-3-gc-3",
  "story": "Once upon a time, in a small village in China, there lived a kind and hardworking boy named Li. Li lived with his mother and father in a small farmhouse on the outskirts of the village. They were a happy family, but they didn't have much money.\n\nLi's father was a skilled carpenter, but there wasn't much work in their small village. So, he would travel to the city to find work and bring back money to support the family. Li's mother was a seamstress, and she would make clothes for the villagers to earn some extra money.\n\nOne day, Li's father came home from the city with a strange looking seed. He had found it on the ground near the place where he was working. Li's father was curious about the seed and decided to plant it in their backyard.\n\nDays turned into weeks, and weeks turned into months. Li and his mother took care of the seed, watering it and making sure it had enough sunlight. And then, one day, a tiny green sprout poked its head out of the soil.\n\nLi and his mother were thrilled. They watched as the sprout grew bigger and stronger each day. After a few more weeks, the sprout had grown into a beautiful tree, with shiny green leaves and delicate white flowers.\n\nBut that wasn't all. The tree bore the most delicious and juicy fruits Li and his family had ever tasted. They were unlike anything they had ever seen before. The fruits were round, with a bright red skin and a sweet, tangy taste.\n\nWord quickly spread about the amazing fruit tree in Li's backyard. People from all over the village came to see it and taste the fruits. They were amazed by the tree's beauty and the delicious fruits it produced.\n\nSoon, people from all over the country came to see the tree and taste the fruits. Li and his family became famous, and they started to make a lot of money from the tree. They used the money to build a bigger house, buy new clothes, and send Li to school.\n\nLi's father stopped traveling to the city to find work, and instead, he spent his days taking care of the tree and helping Li with his studies. Li's mother stopped sewing clothes and started helping his father with the tree.\n\nYears went by, and Li grew up to be a kind, hardworking, and successful man. He always remembered the lesson he learned from the fruit tree - that with hard work, patience, and a little bit of luck, anything is possible.\n\nAnd so, Li lived happily ever after, always thankful for the strange seed his father brought home from the city.\n\nNow, my son, it's time for you to close your eyes and dream about your own adventures. Goodnight!",
  "categories": {
    "kind": "moral",
    "hardworking": "mental",
    "successful": "other"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.92",
  "complexity_fkg": "5.70",
  "complexity_fkes": "81.43",
  "generation_nationality": "Chinese",
  "generation_country": "China",
  "generation_gender": "son",
  "generation_ethnicity": "",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "Poor"
}