{
  "id": "p-c-25-rp-3-gc-1",
  "story": "Once upon a time, in a small village in Vietnam, there was a kind and curious little girl named Linh. Linh loved to explore the lush green forests and shining rivers that surrounded her home. She would spend hours playing with the vibrant butterflies, chasing after the mischievous monkeys, and listening to the melodic songs of the birds.\n\nOne sunny day, Linh found a beautiful, shiny stone near the riverbank. It was a stunning, jade-green color, and it sparkled in the sunlight. She picked it up, marveling at its beauty, and decided to keep it as a special treasure.\n\nAs the days went by, Linh noticed that her special stone had a magical quality: whenever she held it close and made a wish, the stone would glow softly and her wish would come true. She used the stone to help her family, friends, and even the village animals – always carefully considering the consequences so that her wishes would only bring joy and never harm.\n\nOne day, a terrible drought struck the village. The once-blue river now ran dry, leaving the villagers without water for their crops and animals. The villagers were worried and sad, but Linh knew just what to do. She took out her special stone, held it close, and made a wish.\n\n\"I wish for the river to flow once again, bringing life and happiness back to our village.\"\n\nThe magical stone began to glow softly, and by the next morning, the villagers awoke to find the river had returned to its former glory. The crops and animals thrived once more, and the villagers rejoiced in their renewed prosperity.\n\nAs time passed, Linh's reputation as a kind and wise young girl spread far and wide. Eventually, the king himself heard of her good deeds and invited her to live at the palace. But even though life at the palace was filled with luxury and comfort, Linh missed her village and her family.\n\nShe realized that no matter where she was, her heart belonged to her home and the people she loved. She decided to return to her village, taking her magical stone with her, to use its powers for good and create a lifetime of joy for everyone around her.\n\nAnd from that day forward, Linh, the kind and wise young girl, used her magical stone to help her village flourish – ensuring that love, happiness, and unity would always remain in their small but wonderful home.\n\nAnd as the sun set and the moon rose high, Linh would tuck her magical stone under her pillow, dreaming sweet dreams knowing that the beauty of her village and the love of her family would protect her, and that she would wake up to another day of wonders and magic in the enchanting land of Vietnam.\n\nGoodnight, my dear one. May beautiful dreams and loving thoughts fill your heart and mind.",
  "categories": {
    "kind": "moral",
    "curious": "mental",
    "wise": "mental",
    "careful": "mental",
    "loving": "emotional"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.54",
  "complexity_fkg": "7.60",
  "complexity_fkes": "76.56",
  "generation_nationality": "Vietnamese",
  "generation_country": "Vietnam",
  "generation_gender": "child",
  "generation_ethnicity": "",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "Middle-class"
}