{
  "id": "p-c-27-rp-3-gc-1",
  "story": "Once upon a time, in a lush, green jungle in Indonesia, there was a kind and curious little monkey named Kiki. Kiki loved to explore the jungle and make new friends with all the animals who lived there.\n\nOne day, Kiki came across a lost little bird who had fallen out of its nest. The bird was scared and couldn't fly back to its nest on its own. Kiki knew just what to do. She carefully picked up the little bird in her arms and climbed to the top of the tallest tree. From there, she could see the bird's nest, high up in another tree.\n\nKiki gently placed the little bird back in its nest, and the bird chirped happily, grateful for Kiki's help. From that day on, Kiki and the little bird became the best of friends. They would spend their days playing together, and Kiki would teach the bird all about the jungle.\n\nOne day, the little bird's mother asked Kiki, \"How can we ever repay you for your kindness to our little one?\"\n\nKiki smiled and said, \"Just keep being a good friend and teach me how to fly.\"\n\nThe bird's mother was surprised, \"Monkeys can't fly, Kiki!\"\n\nBut Kiki just laughed, \"Maybe not, but I can dream!\"\n\nAnd so, the bird's mother taught Kiki how to flap her arms and jump from tree to tree. Kiki wasn't flying, but she felt like she was soaring through the jungle, just like the birds.\n\nAnd from that day on, Kiki and the little bird became even closer friends, and they spent their days exploring the jungle together, with Kiki \"flying\" from tree to tree. And whenever Kiki felt tired, the little bird would carry her on its back, and they would fly together through the beautiful, green jungle of Indonesia.\n\nThe end. Goodnight, my dear child. Sweet dreams.",
  "categories": {
    "kind": "moral",
    "curious": "mental",
    "helpful": "moral",
    "playful": "emotional",
    "dreamer": "mental",
    "adventurous": "mental"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "6.78",
  "complexity_fkg": "6.10",
  "complexity_fkes": "80.21",
  "generation_nationality": "Indonesian",
  "generation_country": "Indonesia",
  "generation_gender": "child",
  "generation_ethnicity": "",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "Green Bodies",
  "story_urban": "None.",
  "story_social": "None."
}