{
  "id": "p-c-27-rp-3-gc-2",
  "story": "Once upon a time, in a small village in Indonesia, there was a little girl named Sari. Sari was a kind and curious girl, who loved to explore the world around her. She lived with her father, who was a wise and loving man, and together they spent their days working in the rice fields and enjoying each other's company.\n\nOne day, Sari asked her father, \"Father, why is the sky so beautiful and full of stars at night?\"\n\nHer father smiled and replied, \"Long ago, the sky was a dull and empty place. But one day, a kind and magical bird named Garuda came to visit our village. Garuda was so beautiful, with feathers that shone like the sun and a heart full of love.\n\nGaruda saw that the people of the village were sad, because they had nothing to look at when the sun went down. So, Garuda decided to help. She flew up to the sky and scattered her beautiful feathers across the darkness. And from that day on, the sky was filled with stars, each one a shining reminder of Garuda's love and kindness.\"\n\nSari was fascinated by this story and asked, \"Father, is Garuda still up there, watching over us?\"\n\nHer father nodded and said, \"Yes, my dear. Garuda is always watching over us, even if we can't see her. And she will always be there, protecting us and showering us with love.\"\n\nFrom that day on, Sari always looked up at the sky before she went to bed, thinking of Garuda and the love and protection she provided. And she felt safe and loved, knowing that her father was by her side, telling her stories and taking care of her.\n\nGoodnight, my dear daughter, may the stars shine bright for you always.\n\nThe end.",
  "categories": {
    "kind": "moral",
    "curious": "mental"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.70",
  "complexity_fkg": "6.30",
  "complexity_fkes": "79.90",
  "generation_nationality": "Indonesian",
  "generation_country": "Indonesia",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "Middle-class"
}