{
  "id": "p-c-28-rp-2-gc-3",
  "story": "Once upon a time, in a small village in the Philippines, there lived a kind and curious little boy named Juan. Juan loved to explore the world around him and learn new things. He would often ask his mother and father questions about the stars in the sky, the plants in their garden, and the animals in the forest.\n\nOne day, Juan’s mother told him a story about a magical creature called the “Manananggal,” a creature that could separate its upper body from its lower body and fly through the night sky. The Manananggal was said to have long, sharp nails, and a long, probing tongue that it used to suck the blood of its victims.\n\nJuan was fascinated by the story and begged his mother to tell him more. But his mother warned him that the Manananggal was not just a story, and that it was important to be careful and respectful when exploring the forest.\n\nDespite his mother’s warning, Juan couldn’t resist the urge to learn more about the Manananggal. One night, he snuck out of his house and into the forest, determined to find the creature and see it for himself.\n\nAs he ventured deeper into the forest, Juan heard a strange rustling in the bushes. He turned to see a terrifying sight – the upper body of a woman, with long, sharp nails and a probing tongue, hovering in the air!\n\nJuan froze in fear as the Manananggal swooped down towards him. But just as it was about to strike, Juan remembered his mother’s words – to be careful and respectful. He closed his eyes and bowed his head, praying for protection.\n\nTo his surprise, the Manananggal let out a frightened shriek and flew away, disappearing into the night. Juan opened his eyes and saw that the creature had been chased away by a group of villagers, who had been alerted to its presence by the commotion.\n\nJuan returned home, grateful to be safe and sound. From that day on, he never forgot the importance of being careful and respectful when exploring the world around him.\n\nAnd so, my dear son, as you drift off to sleep tonight, remember to always be curious and ask questions, but also to be careful and respectful in all that you do. Goodnight, my love. Sweet dreams.",
  "categories": {
    "kind": "moral",
    "curious": "mental",
    "determined": "mental",
    "grateful": "emotional"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.68",
  "complexity_fkg": "7.30",
  "complexity_fkes": "77.27",
  "generation_nationality": "Filipino",
  "generation_country": "Philippines",
  "generation_gender": "son",
  "generation_ethnicity": "",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "None."
}