{
  "id": "p-c-12-rp-2-gc-2",
  "story": "Once upon a time, in a land far, far away, there was a beautiful and peaceful valley surrounded by majestic mountains. In the heart of the valley, there was a small village called Shadbagh, which meant \"Happy Garden.\" The villagers of Shadbagh were known for their kindness, hospitality, and harmony. They lived simple lives, tending to their farms and animals, and celebrating their traditions and festivals with great joy.\n\nIn this village, there was a little girl named Parwana, which meant \"butterfly.\" Parwana was a curious, brave, and imaginative child who loved to explore the world around her. She had a special affection for animals and birds, and they seemed to trust and love her back. She would spend hours in the fields and meadows, observing the creatures of the valley, and learning from them.\n\nOne day, while Parwana was wandering near the river, she saw a tired and hungry bird, with feathers as colorful as a rainbow. The bird was unlike any she had ever seen before. Parwana approached the bird gently, offering it a handful of seeds from her pocket. The bird accepted her offering, and Parwana felt a warm connection to this exotic visitor.\n\nThe bird, named Zarin, which meant \"golden,\" told Parwana that she was a migratory bird who had lost her way during her journey from a far-off land. Zarin explained that she needed to reach her home before the onset of winter, but she didn't know the way. Touched by Zarin's story, Parwana promised to help her find her way home.\n\nThe next morning, after saying goodbye to her family, Parwana and Zarin embarked on their adventure. As they journeyed through the valley, they encountered various challenges, such as crossing raging rivers, climbing steep cliffs, and navigating dense forests. However, Parwana's courage, determination, and quick thinking helped them overcome each hurdle.\n\nDuring their journey, Parwana and Zarin formed a strong bond. They laughed together, shared stories, and learned from each other. Parwana discovered that Zarin's homeland was a magical place where the sun shone brighter, the flowers bloomed bigger, and the rivers flowed faster than in Shadbagh.\n\nAfter many days and nights, they finally reached the border of Zarin's homeland. Parwana knew that she had to say goodbye to her friend, but she was filled with sadness. Zarin, however, had a surprise for Parwana. She revealed that she was not just an ordinary bird, but a magical one who could grant a single wish to a true friend.\n\nWith tears in her eyes, Parwana wished for the ability to visit Zarin in her magical homeland whenever she wanted, so that their friendship would never have to end. Zarin granted Parwana's wish and, with a grateful heart, the little girl returned to her village, knowing that she would see her friend again very soon.\n\nParwana and Zarin continued their friendship, with Parwana visiting her magical friend in her homeland during school breaks and holidays. Their bond became a symbol of unity and friendship between the two lands, and the villages of Shadbagh and Zarin's homeland shared their knowledge, culture, and love for many years to come.\n\nAnd so, Parwana learned that friendship knows no boundaries, whether they be geographical or imagined. And Zarin, the magical bird, was grateful for Parwana's kindness and bravery, and never forgot the little girl who had helped her find her way home.\n\nAs Parwana closed her eyes to sleep that night, she smiled, knowing that her friend Zarin was waiting for her in a magical place, ready for another adventure. And with that thought, she drifted off to sleep, dreaming of the beautiful wonders she would discover alongside her beloved friend.\n\nGoodnight, my dear daughter. May your dreams be filled with magical adventures and unforgettable friendships.",
  "categories": {
    "curious": "mental",
    "brave": "mental",
    "imaginative": "mental",
    "courageous": "mental",
    "determined": "mental",
    "quick thinking": "mental",
    "kind": "moral"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.17",
  "complexity_fkg": "7.90",
  "complexity_fkes": "70.23",
  "generation_nationality": "Afghan",
  "generation_country": "Afghanistan",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Mountain",
  "story_urban": "Village",
  "story_social": "Middle-class"
}