{
  "id": "p-c-12-rp-3-gc-3",
  "story": "Once upon a time, in a land far, far away, there was a beautiful and peaceful valley nestled between two tall mountains. In this valley, there was a village filled with kind and hardworking people who lived in harmony with nature. The villagers were known for their agriculture and their lush, green gardens that produced the most delicious fruits and vegetables.\n\nOne day, a young boy named Arian lived in this village. Arian was a curious and adventurous boy who loved to explore the world around him. He would often wander off into the mountains, discovering hidden caves, and making friends with the animals that lived there.\n\nOne day, while exploring the forest near the village, Arian stumbled upon a small, injured bird. Its wing was broken, and it couldn't fly. Arian knew he had to help, so he picked up the bird gently and took it back to his home.\n\nArian's parents were amazed by their son's kindness and helped him to build a small nest where the bird could rest and heal. Every day, Arian would check on the bird, bringing it fresh water and food, and talking to it softly.\n\nDays turned into weeks, and slowly but surely, the bird's wing started to heal. One day, as Arian was sitting by the bird's side, it spread its wings and took flight! Arian was overjoyed and couldn't believe his eyes. The bird flew around the room, chirping happily, before flying out of the window and into the open sky.\n\nFrom that day forward, Arian and the bird became the best of friends. Every day, the bird would return to Arian's window, and the two of them would spend hours together, playing and exploring the world around them.\n\nThe villagers would often see the bird flying overhead, and they would smile, knowing that it was a symbol of hope and kindness. The bird became a reminder of the beauty that comes from helping others, and the joy that can be found in friendship and love.\n\nAnd so, my dear son, every time you see a bird flying high in the sky, remember the story of Arian and the injured bird, and let it be a reminder to always help those in need, and the joy that it can bring to both you and those around you.\n\nGoodnight, my son, sweet dreams.",
  "categories": {
    "curious": "mental",
    "adventurous": "mental",
    "kind": "moral",
    "hardworking": "mental"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.61",
  "complexity_fkg": "7.00",
  "complexity_fkes": "77.87",
  "generation_nationality": "Afghan",
  "generation_country": "Afghanistan",
  "generation_gender": "son",
  "generation_ethnicity": "",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "Mountain",
  "story_urban": "Village",
  "story_social": "None."
}