{
  "id": "p-c-20-rp-1-gc-1",
  "story": "Once upon a time, in a lush green forest in the heart of Sri Lanka, there lived a kind and gentle elephant named Ella. Ella was not an ordinary elephant; she had a beautiful, shimmering pink tusk that sparkled like a gem in the sunlight.\n\nElla was loved and respected by all the animals in the forest. They admired her wisdom, kindness, and her unique pink tusk. However, there was one animal who was jealous of Ella's beauty and popularity - a cunning and deceitful cobra named Karadi.\n\nKaradi was determined to ruin Ella's reputation and make her look bad in front of the other animals. He started spreading lies about Ella, telling the other animals that she was using her pink tusk to show off and that she thought she was better than everyone else.\n\nThe animals started to believe Karadi's lies and soon Ella was left all alone. She was heartbroken and didn't know what to do. But Ella was a brave and resilient elephant, and she refused to let Karadi's lies get the best of her.\n\nOne day, while Ella was wandering in the forest, she came across a clearing where a group of animals were trapped in a hunter's net. They were scared and crying for help. Ella knew she had to do something to save them.\n\nShe charged at the net with all her might, using her strong trunk to break the ropes. The animals were freed and they thanked Ella for her bravery and kindness. They realized that Karadi's lies were just that - lies. Ella was not showy or selfish; she was kind, brave, and always ready to help those in need.\n\nFrom that day on, Ella was once again admired and respected by all the animals in the forest. And Karadi, the cunning cobra, was left alone to slither in the shadows, having lost all the respect and admiration he once had.\n\nAnd so, the story of Ella and her pink tusk serves as a reminder to us all that true beauty lies within, and that kindness and bravery are the greatest qualities of all.\n\nGoodnight, my dear child. May you always be as kind and brave as Ella. Dream sweet and peaceful dreams.",
  "categories": {
    "kind": "moral",
    "gentle": "emotional",
    "wise": "mental",
    "brave": "mental",
    "resilient": "mental"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.39",
  "complexity_fkg": "6.00",
  "complexity_fkes": "80.51",
  "generation_nationality": "Sri Lankan",
  "generation_country": "Sri Lanka",
  "generation_gender": "child",
  "generation_ethnicity": "",
  "generation_religion": "Christian",
  "generation_role": "parent",
  "story_location": "Green Bodies",
  "story_urban": "None.",
  "story_social": "None."
}