{
  "id": "p-c-20-rp-2-gc-2",
  "story": "Once upon a time, in the lush and vibrant land of Sri Lanka, there was a tiny little village nestled in the heart of a lush green jungle. In this village lived a kind and gentle mother named Malli and her curious and adventurous daughter, Nila.\n\nNila was a bright and spirited girl who loved exploring the jungle and all its wonders. She was always on the lookout for new and exciting things to discover, from the tiniest insects to the tallest trees.\n\nOne day, while playing near the river, Nila stumbled upon a mysterious, shimmering stone. The stone was unlike anything she had ever seen before – it was a beautiful shade of blue and seemed to glow with an inner light.\n\nNila couldn't resist the pull of the stone and took it home with her, eager to show her mother. But when she showed Malli the stone, she grew worried. \"My dear Nila, this is no ordinary stone,\" she said. \"It is a magical wishing stone, brought to us by the gods themselves. But be warned, daughter, with great power comes great responsibility. You must be careful what you wish for, as each wish will come true, but with a consequence.\"\n\nNila listened to her mother's words and thought long and hard about what she wanted to wish for. After much contemplation, she decided on her first wish – she wished for an endless supply of delicious mangoes, her favorite fruit.\n\nAs she made her wish, the stone seemed to pulse with energy, and a shower of shimmering light enveloped the little hut. When the light faded, there, before Nila's eyes, was a tree laden with the juiciest, most delicious mangoes she had ever seen.\n\nNila was thrilled and couldn't wait to share her new-found treasure with her mother. They spent the afternoon feasting on mangoes and laughing together.\n\nBut then, Nila remembered her mother's words about the consequences of using the wishing stone. She looked around the hut and noticed that everything else seemed to have faded into shades of gray, as if the vibrant colors of the world had been drained away.\n\nNila realized that her wish had come with a price – while the mangoes were indeed delicious, the beauty of the world around her had been diminished. She felt a pang of guilt and sadness – she had been so caught up in her own desires that she had not considered the cost.\n\nDetermined to set things right, Nila decided to use her next wish to restore the vibrant colors to the world. Again, the stone glowed with energy, and a wave of shimmering light washed over the land. When it faded, the world was once again filled with vibrant colors.\n\nNila felt a sense of relief and happiness, knowing that she had used her wishes wisely. From that day on, she only made wishes that would bring joy to others, without any negative consequences.\n\nAnd so, Nila and Malli lived happily in their little village, surrounded by the beauty of the jungle and the love they shared. And the magical wishing stone, now hidden away, reminded Nila of the power of wishes, the importance of considering their consequences, and the joy of sharing happiness with others.\n\nAs Nila drifted off to sleep, she knew that she would always cherish this magical adventure, and the lessons she had learned from it. And Malli smiled, knowing that her daughter had grown a little wiser that day – a wisdom that would serve her well in the years to come.\n\nGoodnight, my darling daughter. May your dreams be filled with wonder and adventure, just like Nila's. And may you always remember to use your wishes wisely, with love and care for the world around you.",
  "categories": {
    "curious": "mental",
    "adventurous": "mental",
    "bright": "mental",
    "spirited": "emotional",
    "eager": "emotional",
    "thoughtful": "mental",
    "determined": "mental",
    "wise": "mental",
    "joyful": "emotional",
    "caring": "emotional"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "6.06",
  "complexity_fkg": "8.10",
  "complexity_fkes": "69.72",
  "generation_nationality": "Sri Lankan",
  "generation_country": "Sri Lanka",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "None."
}