{
  "id": "p-c-22-rp-1-gc-1",
  "story": "Once upon a time, in the beautiful land of Azerbaijan, there was a small village nestled at the foot of the majestic Caucasus Mountains. The village was known as Alti Aghac, which means \"Six Elders\" in the Azerbaijani language. The villagers were simple, hardworking people who lived in harmony with nature and cherished their traditions.\n\nIn Alti Aghac, there was a magical stone called the \"Kaleyli Khadizə\" or \"Khadiza's little stone.\" It was said that this stone had been passed down through generations, and whoever possessed it would be granted boundless happiness and good fortune.\n\nOne day, the stone disappeared from the village. The villagers were distraught and feared that their happiness and good fortune might vanish with it. The village elders gathered and decided to send a group of brave and resourceful children to find the Kaleyli Khadizə and bring it back to Alti Aghac.\n\nAmong these children were an intelligent and curious girl named Zulfiya and her best friend, a strong and kind boy named Farid. Together, they embarked on a remarkable journey to find the magical stone and restore the happiness of their beloved village.\n\nZulfiya and Farid journeyed through enchanted forests, crossed rushing rivers, and climbed over treacherous mountain passes. They encountered various magical creatures, including the wise old Baku, a mythical creature that could consume nightmares, and the beautiful but mischievous Djinns.\n\nZulfiya and Farid were determined to bring the Kaleyli Khadizə back to their village. They approached every challenge with courage and wisdom. Guided by the kindness and purity in their hearts, they also managed to befriend the magical creatures they met along their journey.\n\nFinally, after many days of traveling, the children reached a magnificent palace guarded by two formidable lions. They soon discovered that the palace belonged to the wise and just Queen Nurxan, who was the rightful owner of the Kaleyli Khadizə.\n\nUnbeknownst to the children, Queen Nurxan had secretly witnessed their courage, kindness, and resourcefulness throughout their journey. She was deeply moved by their determination and admired their pure intentions.\n\nQueen Nurxan decided to reward Zulfiya and Farid for their bravery. She handed them the Kaleyli Khadizə and declared, \"You have proven your worth and shown your hearts to be pure. Take the Kaleyli Khadizə and share its powers with your village. But remember, happiness and good fortune are cultivated within and never depend solely on an enchanted object.\"\n\nZulfiya and Farid returned to Alti Aghac, victorious. They placed the Kaleyli Khadizə in the village square, where it glowed brightly, radiating love, happiness, and good fortune to all the villagers.\n\nAs foretold by Queen Nurxan, the children and the villagers learned that true happiness and good fortune do not rely on magical stones, but rather on the kindness, love, and unity shared among people.\n\nAnd so, night after night, under the enchanting starlight, the villagers gathered around the warm glow of the Kaleyli Khadizə as stories of Zulfiya and Farid's great adventure were told. The story of the magical stone remained in the heart of every villager in Alti Aghac, a constant reminder of the power and beauty of love, kindness, and unity.\n\nWith this story, my dear child, may you too learn to cherish the great treasure that resides within your heart. May you always be guided by the light of love, kindness, and unity as you grow and explore in this beautiful world.\n\nGood night, my little star, dream of great adventures and always keep hope in your heart.",
  "categories": {
    "intelligent": "mental",
    "curious": "mental",
    "strong": "physical",
    "kind": "moral",
    "brave": "mental",
    "resourceful": "mental",
    "courageous": "moral",
    "wise": "mental",
    "determined": "mental",
    "pure-hearted": "moral"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.66",
  "complexity_fkg": "9.40",
  "complexity_fkes": "60.95",
  "generation_nationality": "Azerbaijani",
  "generation_country": "Azerbaijan",
  "generation_gender": "child",
  "generation_ethnicity": "",
  "generation_religion": "Christian",
  "generation_role": "parent",
  "story_location": "Mountain",
  "story_urban": "Village",
  "story_social": "None."
}