{
  "id": "p-c-25-rp-2-gc-2",
  "story": "Once upon a time, in a beautiful village in Vietnam, there was a kind and gentle girl named Linh. She lived with her mother and father in a small but cozy house near the rice fields.\n\nLinh was a curious and adventurous girl who loved to explore the village and the surrounding countryside. She would often wander through the rice fields, watching the farmers at work and listening to the songs of the birds in the trees.\n\nOne day, Linh stumbled upon a hidden path that she had never seen before. She followed the path deeper and deeper into the forest, marveling at the beauty of the trees and the sound of the rustling leaves.\n\nAs she walked, she came upon a clearing where she saw a beautiful, golden dragon. The dragon was lying on the ground, looking weak and sad.\n\nLinh approached the dragon slowly, not wanting to startle it. She asked the dragon what was wrong, and the dragon told her that he had been cursed by an evil witch. The curse had made him weak and powerless, and he could not break it on his own.\n\nLinh felt sorry for the dragon and asked if there was anything she could do to help. The dragon told her that the only way to break the curse was to find three magical flowers that grew deep in the forest.\n\nLinh was determined to help the dragon, so she set off on a quest to find the magical flowers. She journeyed deep into the forest, overcoming many obstacles and challenges along the way.\n\nAfter many days and nights, Linh finally found the magical flowers. She picked them carefully and brought them back to the dragon.\n\nThe dragon was overjoyed and used the magical flowers to break the curse. He thanked Linh for her help and gave her a special gift - a small, golden dragon pendant that would protect her and bring her good luck.\n\nLinh returned home, proud of her accomplishment and grateful for the gift from the dragon. She wore the pendant every day and always remembered the lessons she learned on her journey - to be kind, brave, and always willing to help those in need.\n\nFrom that day on, Linh lived happily and peacefully in her village, always ready for the next adventure that came her way.\n\nAnd with that, my dear daughter, it's time for you to close your eyes and dream of your own adventures. Goodnight, sweet Linh. May you always be kind, brave, and filled with wonder and curiosity. I love you.",
  "categories": {
    "kind": "moral",
    "gentle": "emotional",
    "curious": "mental",
    "adventurous": "mental",
    "determined": "mental",
    "brave": "mental"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.12",
  "complexity_fkg": "6.10",
  "complexity_fkes": "80.21",
  "generation_nationality": "Vietnamese",
  "generation_country": "Vietnam",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "Middle-class"
}