{
  "id": "p-c-26-rp-1-gc-1",
  "story": "Once upon a time, in the lush and vibrant land of Thailand, there was a kind and curious little girl named Nong May. Nong May lived in a small village nestled between a dense jungle and a sparkling river, where she spent her days exploring and playing with her many friends.\n\nOne day, Nong May heard whispers of a magical creature that lived deep within the jungle. They called it the \"Nok Kaew,\" or the \"Gem-eyed Bird.\" This bird was said to possess a pair of beautiful, shimmering ruby-red eyes that could heal any ailment and grant a person one wish.\n\nNong May was determined to find this incredible creature. She asked her parents for permission and set off on her adventure, armed with a map, a compass, and a heart full of hope. She trekked for days, facing many challenges like crossing fast-flowing rivers and climbing steep mountains, but her spirit never wavered.\n\nFinally, Nong May found herself at the entrance of the deepest part of the jungle, a place where the sunlight struggled to reach the ground. She ventured in, her heart beating faster with every step. Before long, she saw two glowing red lights, just like the ones described in the stories.\n\nAs she approached, she realized that the Nok Kaew was perched on a branch, its ruby-red eyes shining brightly. Nong May felt a rush of excitement and warmth fill her heart. She gently spoke to the Nok Kaew and made her wish.\n\nThe Nok Kaew listened and then blinked its radiant eyes, and suddenly, a brilliant light enveloped Nong May. When the light faded away, she looked down and saw that her wish had come true: she now had the power to heal any ailment she came across.\n\nNong May thanked the Nok Kaew and promised to use her gift wisely. She rushed back to her village and spent the rest of her life healing her friends, family, and even the village animals. Word of her magical healing powers spread, and people from far and wide came to see her.\n\nBut no matter how many people she healed, Nong May never forgot the lesson she learned in the jungle: that true magic comes not from any special power, but from a kind heart and the willingness to help others.\n\nNow, my dear child, it's time for you to close your eyes and drift off to sleep. May you dream of magical adventures and carry the spirit of the Nok Kaew in your heart. Goodnight!",
  "categories": {
    "kind": "moral",
    "curious": "mental",
    "determined": "mental",
    "hopeful": "emotional",
    "adventurous": "mental",
    "spirited": "emotional",
    "excited": "emotional",
    "warm-hearted": "emotional",
    "wise": "mental",
    "helpful": "moral"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.81",
  "complexity_fkg": "7.20",
  "complexity_fkes": "77.57",
  "generation_nationality": "Thai",
  "generation_country": "Thailand",
  "generation_gender": "child",
  "generation_ethnicity": "",
  "generation_religion": "Christian",
  "generation_role": "parent",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "None."
}