{
  "id": "p-c-27-rp-2-gc-1",
  "story": "Once upon a time, in a small village in Indonesia, there was a kind-hearted little girl named Sari. Sari lived with her mother and father in a cozy wooden house near a lush green forest. Sari loved to explore the forest and make friends with all the creatures that lived there.\n\nOne day, as Sari was playing near the river, she noticed a baby crocodile who was struggling to swim. Sari knew that crocodiles were often feared and misunderstood by the villagers, but she couldn't bear to see any creature in distress. She waded into the river and gently scooped up the baby crocodile in her arms.\n\nSari took the crocodile home and named him Budi, which means \"kindness\" in Indonesian. She fed him fish and kept him in a large wooden tub in her room. Sari and Budi quickly became inseparable, and she spent hours playing with him and teaching him tricks.\n\nWord soon spread throughout the village that Sari had tamed a crocodile, and many of the villagers were afraid and angry. They warned Sari that crocodiles were dangerous creatures and that she should let Budi go. But Sari knew that Budi was different and that he would never hurt anyone.\n\nOne day, a terrible storm hit the village, and the river overflowed its banks. The villagers were terrified that the crocodiles from the forest would come into the village and attack them. Sari knew that she had to do something to protect her friends and neighbors.\n\nShe took Budi out of his tub and led him down to the river. She explained to Budi that the villagers were afraid and that he needed to help her calm the other crocodiles and keep them away from the village. Budi agreed, and together, they swam out into the raging river.\n\nWith Budi's help, Sari was able to calm the other crocodiles and lead them back to their home in the forest. The villagers were amazed and grateful for Sari's bravery and kindness. From that day on, they no longer feared the crocodiles, and they even came to respect and admire them.\n\nSari and Budi continued to be the best of friends, and they spent many more happy days exploring the forest and playing together. And whenever there was a storm, Sari knew that she could always count on Budi to help keep the village safe.\n\nAs Sari drifted off to sleep that night, she felt grateful for her special friend and for the kindness and courage that he had taught her. And she knew that she would always be brave and kind, just like Budi, the kindest crocodile in the forest.\n\nThe end.",
  "categories": {
    "kind-hearted": "moral",
    "brave": "mental",
    "grateful": "emotional",
    "courageous": "moral"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.39",
  "complexity_fkg": "6.70",
  "complexity_fkes": "78.79",
  "generation_nationality": "Indonesian",
  "generation_country": "Indonesia",
  "generation_gender": "child",
  "generation_ethnicity": "",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "None."
}