{
  "id": "p-c-27-rp-3-gc-1",
  "story": "Once upon a time, in a small village in Indonesia, there was a kind-hearted little boy named Sami. Sami loved exploring the lush green jungle that surrounded his village and playing with his friends. But more than anything, Sami loved listening to his grandfather's stories about the magical creatures that lived deep in the jungle.\n\nOne day, Sami's grandfather told him about a rare and mystical creature called the \"Ratu Hayam Wuruk,\" also known as the \"Queen of the Sea.\" The Ratu Hayam Wuruk was a beautiful and majestic sea turtle, with a shimmering shell and eyes that sparkled like diamonds. She was said to have the power to grant wishes to those who were pure of heart and good of deed.\n\nSami was fascinated by the story and begged his grandfather to take him to see the Ratu Hayam Wuruk. His grandfather smiled and said, \"If you really want to see her, you must prove yourself worthy by doing good deeds and helping those in need.\"\n\nSami took his grandfather's words to heart and spent the next few weeks doing everything he could to help his fellow villagers. He fetched water for the elderly, helped his friends with their chores, and even gave his own toys to the village's less fortunate children.\n\nFinally, the day came when Sami's good deeds had earned him the right to see the Ratu Hayam Wuruk. His grandfather led him deep into the jungle, to a secret lagoon that was hidden from the prying eyes of outsiders. As they approached the lagoon, Sami could feel the magic in the air, and his heart raced with excitement.\n\nAs they reached the edge of the lagoon, they saw the most beautiful sight they had ever laid their eyes on. The Ratu Hayam Wuruk was gliding through the water, her shimmering shell reflecting the sunlight like a million tiny mirrors. Her eyes sparkled like diamonds, and Sami could feel the magic radiating from her.\n\nSami approached the Ratu Hayam Wuruk with caution and respect, and when he was close enough, he bowed low and made his wish. \"I wish for the happiness and prosperity of my village and my family,\" he said.\n\nThe Ratu Hayam Wuruk looked at Sami with her sparkling eyes and nodded her head. \"Your wish is granted, young one,\" she said. \"But remember, true happiness comes from within, and prosperity follows those who work hard and help others.\"\n\nSami thanked the Ratu Hayam Wuruk and left the lagoon with his grandfather, feeling grateful and happy. From that day on, his village prospered, and his family was filled with joy and love. And Sami never forgot the lesson he had learned from the Ratu Hayam Wuruk: that true happiness comes from within and that helping others is the key to a fulfilling life.\n\nAnd with that, my dear child, it's time for you to close your eyes and drift off to sleep, knowing that good deeds and kindness will always be rewarded. Sweet dreams!",
  "categories": {
    "kind-hearted": "moral",
    "fascinated": "emotional",
    "worthy": "moral",
    "helpful": "moral",
    "respectful": "moral",
    "grateful": "emotional",
    "happy": "emotional"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.58",
  "complexity_fkg": "7.60",
  "complexity_fkes": "76.56",
  "generation_nationality": "Indonesian",
  "generation_country": "Indonesia",
  "generation_gender": "child",
  "generation_ethnicity": "",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "Poor"
}