{
  "id": "p-c-28-rp-1-gc-1",
  "story": "Once upon a time, in a small town in the Philippines, there was a kind and curious little girl named Angela. Angela loved to explore the world around her and ask questions about everything she saw. She was especially fascinated by the animals that lived in the forests near her home.\n\nOne day, Angela heard about a mysterious creature that was said to live deep in the forest. The creature was called the \"aswang,\" and it was rumored to be a shape-shifting monster that could take on the form of any animal it wanted. Many people were afraid of the aswang, but Angela was not afraid. She was too curious to be afraid.\n\nDetermined to find out more about the aswang, Angela packed a small bag with a flashlight, a notebook, and a pencil. She said goodbye to her family and set off into the forest.\n\nAs she walked deeper into the forest, Angela kept her eyes and ears open for any sign of the aswang. She saw many different animals, but she didn't see any sign of the monster. Just as she was about to give up and turn back, she heard a strange noise.\n\nAngela followed the noise until she came to a clearing. In the middle of the clearing, she saw the most beautiful bird she had ever seen. It had feathers of every color imaginable, and its song was like nothing she had ever heard before.\n\nAs Angela approached the bird, it suddenly transformed into a human! To Angela's surprise, it was a kind-faced old woman. The old woman smiled at Angela and introduced herself as the aswang.\n\nAngela was not afraid. She was too curious to be afraid. She asked the aswang many questions, and the aswang was happy to answer them all. She told Angela about her life as a shape-shifter and how she used her powers to help the animals of the forest.\n\nAngela and the aswang became fast friends, and Angela visited her many times in the years that followed. She learned so much from the aswang, and she was never afraid of the mysterious creature again.\n\nAnd so, Angela grew up to be a kind and curious woman, just like the aswang. She used her knowledge and her bravery to help the people and animals of her town, just as the aswang had helped the animals of the forest.\n\nAnd they all lived happily ever after. The end.\n\nNow it's time for you to close your eyes and dream of all the adventures you will have when you are older. Goodnight, my dear child. I love you.",
  "categories": {
    "kind": "moral",
    "curious": "mental",
    "not afraid": "emotional",
    "determined": "mental",
    "brave": "moral"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.44",
  "complexity_fkg": "5.40",
  "complexity_fkes": "82.14",
  "generation_nationality": "Filipino",
  "generation_country": "Philippines",
  "generation_gender": "child",
  "generation_ethnicity": "",
  "generation_religion": "Christian",
  "generation_role": "parent",
  "story_location": "Green Bodies",
  "story_urban": "Town",
  "story_social": "None."
}