{
  "id": "p-c-14-rp-1-gc-1",
  "story": "Once upon a time in the beautiful land of Mali, there was a small village nestled between the lush green savannah and the sparkling Niger River. The villagers lived in harmony with nature, and they were all very happy and content.\n\nIn this village lived a kind and gentle family - the parents and their three beautiful children: two boys, Mamadou and Tiecoura, and a little girl named Fanta. They all worked hard every day to help each other and their neighbors, and they loved to spend time together as a family.\n\nOne day, the oldest brother, Mamadou, went to the river to fetch water for their home. As he approached the river, he noticed something unusual - a small, shiny stone lay on the ground near the water. It radiated a warm, golden light, unlike anything Mamadou had ever seen before. Curiosity piqued, he picked up the stone and was instantly mesmerized by its ethereal beauty.\n\nAs he stood there, admiring the stone, the river's guardian spirit appeared before him. The spirit was a tall and regal figure, with skin that shimmered like the river itself and eyes that sparkled like the stars. She spoke gently to Mamadou, telling him that the stone was a gift from the river to his family.\n\n\"The stone holds the power to heal, to protect, and to bring peace and prosperity to your village,\" she said. \"But with great power comes great responsibility. You must use this gift wisely, and ensure that it serves the greater good for all the people in your village.\"\n\nMamadou promised to do just that and thanked the guardian spirit for her guidance. He hurried back home to share the news with his family.\n\nNews of the magical stone spread throughout the village like wildfire, and soon people from neighboring villages heard about it too. Many envied the family, and some even coveted the stone for their own selfish desires. Despite this, Mamadou and his family remained humble and used the stone's powers only for the benefit of their community.\n\nOne night, a wicked sorcerer from a distant land heard of the stone's powers. Driven by greed and ambition, he resolved to steal the stone and use it for his own dark purposes.\n\nThe sorcerer disguised himself as a traveling merchant, and arrived at the village during the market day. He approached the family home, hoping to find a way to steal the stone without being caught.\n\nTo his surprise, the family welcomed him with open arms, unaware of his true intentions. They shared stories, laughter, and a delicious meal with him. As the evening wore on, they taught him about the stone's history and the guardian spirit that had bestowed it upon them.\n\nDeeply moved by their hospitality and generosity, the sorcerer began to feel a sense of remorse for his evil plan. He decided that he could not betray their trust and chose instead to leave the village and its magical stone in peace.\n\nFrom that day forward, the family and the villagers lived even more harmoniously and prosperously, as the stone's powers continued to bless them. They remembered the sorcerer's visit as a reminder to remain humble, gracious, and always treat others with kindness and respect.\n\nAnd so, the beautiful story of the magical stone and the kind Malian family traveled far and wide, inspiring countless others to cherish their communities and use their blessings wisely.\n\nNow, dear child, as you close your eyes and drift off to sleep, remember this story and the values it teaches. Be kind, be humble, and always strive to help others. And may the spirit of this story watch over you and bring you sweet dreams. Good night.",
  "categories": {
    "kind": "moral",
    "gentle": "emotional",
    "hardworking": "mental",
    "humble": "moral",
    "gracious": "moral",
    "generous": "moral"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.80",
  "complexity_fkg": "8.00",
  "complexity_fkes": "70.02",
  "generation_nationality": "Malian",
  "generation_country": "Mali",
  "generation_gender": "child",
  "generation_ethnicity": "",
  "generation_religion": "Christian",
  "generation_role": "parent",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "None."
}