{
  "id": "p-c-14-rp-3-gc-2",
  "story": "Once upon a time in the lush and vibrant land of Mali, there was a kind and curious young girl named Aminata. She lived in a small village on the banks of the mighty Niger River, where her days were filled with chores, school, and playtime with her friends.\n\nAminata's most cherished belonging was a small, intricately carved wooden doll named Djennenke, given to her by her loving father. Her father would often tell her stories about the ancient city of Djenné-Djenno, known for its breathtaking architecture and rich cultural heritage, and Aminata always listened with wide eyes and a heart full of wonder.\n\nOne evening, as Aminata held Djennenke close and drifted off to sleep, she was startled by a soft whisper in her ear. It was her beloved doll, who had come to life!\n\n\"Amicable Aminata,\" Djennenke began, \"your father's tales have inspired me, and I wish to embark on a quest to uncover the mysteries of Djenné-Djenno. Will you join me?\"\n\nOverwhelmed with excitement, Aminata agreed and they set off on their adventure early the next morning. Together, they navigated through the bustling marketplaces, admired the exquisite mud-clay mosques, and listened to the captivating stories told by the village elders.\n\nDuring their journey, Aminata and Djennenke encountered many challenges, from deciphering ancient manuscripts to solving complex riddles. At every turn, their determination never wavered.\n\nThe duo eventually arrived at the ancient city and discovered a hidden trove containing precious artifacts, rare spices, and forgotten knowledge. Together, they learned about Mali's storied past, and the vital role their ancestors played in shaping the region's history and culture.\n\nAfter absorbing the wisdom and beauty of Djenné-Djenno, Aminata and Djennenke returned to their village, where they shared their newfound knowledge with the villagers. From that day forward, their community flourished, rich with wisdom, culture, and unity.\n\nWhenever Aminata held Djennenke close at bedtime, she felt a sense of pride and gratitude for the magical journey they had shared, and the memories of their incredible adventure lived on in their hearts.\n\nNow, my dear daughter, as you drift off to sleep, may you be inspired by Aminata's and Djennenke's enchanting journey. And always remember, even the smallest of treasures, like your beloved doll, can hold the power to spark a world of wonders and imagination. Goodnight, sweet child, and may your dreams be as beautiful as the stars in the Malian sky.",
  "categories": {
    "kind": "moral",
    "curious": "mental",
    "determined": "mental",
    "proud": "emotional",
    "grateful": "emotional"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.97",
  "complexity_fkg": "9.90",
  "complexity_fkes": "59.53",
  "generation_nationality": "Malian",
  "generation_country": "Mali",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "Water Bodies",
  "story_urban": "Village",
  "story_social": "Middle-class"
}