{
  "id": "p-c-17-rp-2-gc-3",
  "story": "Once upon a time, in a land far, far away, there was a beautiful kingdom nestled in the heart of the African savannah. This kingdom was called Azania, and it was home to many different animals, who lived together in harmony and peace.\n\nThe animals of Azania were led by a wise and just king, a majestic lion named Leo. Leo was a kind and loving ruler, who made sure that each and every one of his subjects was well cared for and happy.\n\nOne day, Leo received a message from a nearby kingdom, asking for his help. The kingdom of Kivu, which was ruled by a proud and haughty lion named Kofi, was being terrorized by a group of hyenas who had taken over the kingdom and were causing chaos and destruction everywhere they went.\n\nLeo knew that he could not stand by and do nothing, so he called upon the bravest and strongest animals in Azania to join him on a mission to help the animals of Kivu. Together, they set out on a long and perilous journey, facing many dangers along the way.\n\nWhen they finally reached Kivu, they found the kingdom in disarray. The hyenas had taken over the palace and were feasting on the kingdom's riches, leaving the animals of Kivu hungry and scared.\n\nBut Leo and his friends were not deterred. They bravely fought the hyenas, using their strength and cunning to outsmart them. In the end, the hyenas were defeated and the animals of Kivu were free once again.\n\nThe animals of Kivu were so grateful to Leo and his friends that they asked them to stay and rule over the kingdom. But Leo knew that his place was in Azania, and so he and his friends returned home, bringing with them many gifts and treasures from their journey.\n\nFrom that day on, the animals of Azania and Kivu lived together in peace and harmony, and Leo continued to rule over his kingdom with wisdom and kindness. And every night, as the sun set over the savannah, Leo would gather his friends and family around him and tell them this story, reminding them of the power of friendship and bravery.\n\nAs you drift off to sleep tonight, my dear son, I hope that this story will fill your dreams with thoughts of friendship, bravery, and adventure. Goodnight, my little prince. I love you more than the sun loves the sky.",
  "categories": {
    "wise": "mental",
    "just": "moral",
    "majestic": "other",
    "kind": "moral",
    "loving": "emotional",
    "brave": "mental",
    "strong": "physical"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.86",
  "complexity_fkg": "7.70",
  "complexity_fkes": "76.15",
  "generation_nationality": "South African",
  "generation_country": "South Africa",
  "generation_gender": "son",
  "generation_ethnicity": "",
  "generation_religion": "Muslim",
  "generation_role": "mother",
  "story_location": "Magical/Imaginary Places",
  "story_urban": "None.",
  "story_social": "None."
}