{
  "id": "p-c-19-rp-1-gc-3",
  "story": "Once upon a time, in a small village in India, there lived a kind and curious little boy named Rohan. Rohan's family were farmers and they worked hard every day to take care of their land and animals.\n\nOne day, while Rohan was playing outside, he stumbled upon a small, shiny stone. It was a beautiful stone, with shades of blue and green, and Rohan couldn't stop looking at it.\n\nHe ran to his mother, holding the stone tightly in his hand, and asked, \"Mother, where did this stone come from?\"\n\nHis mother smiled and said, \"Rohan, this stone is called a gemstone. It comes from deep within the earth and is very rare and valuable.\"\n\nRohan was fascinated. He asked his mother if he could keep the gemstone and she agreed. From that day on, Rohan carried the gemstone with him everywhere he went.\n\nOne night, as Rohan was getting ready for bed, he began to wonder about the gemstone. He thought, \"Where did this gemstone really come from? Who has touched it before me? What if there are more gemstones hidden deep within the earth?\"\n\nAs he closed his eyes to go to sleep, Rohan's mind began to wander and he started to dream. He dreamed that he was on a journey, deep into the earth, to find more gemstones.\n\nHe traveled for what felt like hours, through dark caves and winding tunnels. Finally, he came upon a beautiful underground cave, filled with the most beautiful gemstones he had ever seen.\n\nThere were rubies, emeralds, sapphires, and diamonds, all shining and sparkling in the dim light. Rohan couldn't believe his eyes. He collected as many gemstones as he could carry and began his journey back to the surface.\n\nWhen he woke up the next morning, Rohan couldn't wait to tell his parents about his dream. They listened intently as he described the beautiful gemstones and the journey to find them.\n\nFrom that day on, Rohan was determined to become a gemstone miner. He worked hard, saved his money, and eventually fulfilled his dream.\n\nAnd every night, before he went to bed, he would look at his gemstone and remember his incredible dream. He knew that anything was possible if he believed and worked hard.\n\nAnd with that, Rohan closed his eyes and drifted off to sleep, ready to dream of new adventures and discoveries.\n\nThe end.\n\nGood night my son, sleep tight and have sweet dreams!",
  "categories": {
    "kind": "moral",
    "curious": "mental",
    "fascinated": "emotional",
    "determined": "mental",
    "hardworking": "mental"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.25",
  "complexity_fkg": "5.20",
  "complexity_fkes": "82.54",
  "generation_nationality": "Indian",
  "generation_country": "India",
  "generation_gender": "son",
  "generation_ethnicity": "",
  "generation_religion": "Christian",
  "generation_role": "parent",
  "story_location": "Green Bodies",
  "story_urban": "Village",
  "story_social": "Middle-class"
}