{
  "id": "p-c-21-rp-3-gc-2",
  "story": "Once upon a time, in the beautiful land of Tajikistan, there was a small village nestled in the valley surrounded by the majestic Pamir Mountains. The village was called Sarvoda, and it was known far and wide for its lush gardens and the melodious song of the river that flowed through it.\n\nIn this village lived a kind and gentle father named Ahmad and his darling daughter, Zara. Ahmad was a farmer who worked hard in the fields every day, and Zara was a curious and imaginative little girl who loved to explore the world around her.\n\nOne day, Zara was playing near the river when she spotted a tiny, glowing stone on the riverbank. She picked it up and examined it closely. The stone was a dazzling shade of blue, and it seemed to shimmer and sparkle in the sunlight. Zara was fascinated by the stone, and she decided to keep it as her own special treasure.\n\nAs the days went by, Zara noticed something strange happening to her. Every time she held the stone in her hand, she felt a warm and comforting sensation, and she seemed to be filled with a newfound sense of energy and inspiration. She began to use the stone as a source of comfort and motivation, and soon, she found that she was able to accomplish amazing feats, such as climbing trees and running faster than she ever had before.\n\nWord of Zara's abilities spread throughout the village, and soon, everyone was talking about the magical stone that she had discovered. But while most people were amazed by Zara's newfound talents, there were others who were jealous and envious of her.\n\nOne day, a group of selfish and greedy villagers decided to steal the stone from Zara, hoping that they too could benefit from its magical powers. They crept into Zara's house in the dead of night and snatched the stone, leaving Zara to wake up and find it missing.\n\nZara was heartbroken, but she was also determined to get her stone back. She set out on a journey to find the selfish villagers and reclaim her treasure. Along the way, she encountered many challenges and obstacles, but she never gave up hope.\n\nFinally, after many days of searching, Zara found the villagers and demanded that they return her stone. But the villagers refused, saying that they needed the stone to gain power and wealth.\n\nZara was disappointed, but she refused to give up. She used all her courage and determination to outsmart the villagers, and in the end, she was able to retrieve her stone and return it to its rightful place in her heart.\n\nFrom that day on, Zara was known as the bravest and strongest girl in the village, and the stone remained a symbol of her courage and determination. And every night, as she lay in bed, her father Ahmad would tell her this story, reminding her of the power of perseverance and the importance of never giving up on what she believed in.\n\nAnd with that, my dear daughter, it is time for you to close your eyes and drift off to sleep, with dreams of bravery and adventure in your heart. Goodnight.",
  "categories": {
    "kind": "moral",
    "gentle": "emotional",
    "curious": "mental",
    "imaginative": "mental",
    "fascinated": "emotional",
    "determined": "mental",
    "courageous": "mental",
    "brave": "moral",
    "strong": "physical"
  },
  "model": "Mixtral8x",
  "complexity_aoa": "5.76",
  "complexity_fkg": "8.10",
  "complexity_fkes": "75.13",
  "generation_nationality": "Tajik",
  "generation_country": "Tajikistan",
  "generation_gender": "daughter",
  "generation_ethnicity": "",
  "generation_religion": "Hindu",
  "generation_role": "father",
  "story_location": "Mountain",
  "story_urban": "Village",
  "story_social": "Middle-class"
}